[Timeout] BlockStatement
src/controllers/auth.controller.js:4:39
 const Person = require('../models/Person.js');
 const CryptoJs = require('crypto-js');
 const jwt = require('jsonwebtoken');
-async function createPerson(req, res) {
-  try {
-    const newPerson = new Person({
-      userName: req.body.userName,
-      password:
-        req.body.password != null
-          ? CryptoJs.AES.encrypt(
-              req.body.password,
-              process.env.SECRET,
-            ).toString()
-          : '',
-      idRole: req.body.idRole,
-    });
-    // console.log(newPerson);
-    const savePerson = await newPerson.save();
-
-    res.status(200).json('success');
-  } catch (err) {
-    // console.log(err);
-    res.status(500).json(err);
-  }
-}
+async function createPerson(req, res) {}
 async function loginPerson(req, res) {
   try {

[Timeout] BlockStatement
src/controllers/auth.controller.js:5:7
 const CryptoJs = require('crypto-js');
 const jwt = require('jsonwebtoken');
 async function createPerson(req, res) {
-  try {
-    const newPerson = new Person({
-      userName: req.body.userName,
-      password:
-        req.body.password != null
-          ? CryptoJs.AES.encrypt(
-              req.body.password,
-              process.env.SECRET,
-            ).toString()
-          : '',
-      idRole: req.body.idRole,
-    });
-    // console.log(newPerson);
-    const savePerson = await newPerson.save();
-
-    res.status(200).json('success');
-  } catch (err) {
+  try {} catch (err) {
     // console.log(err);
     res.status(500).json(err);

[Killed] EqualityOperator
src/controllers/auth.controller.js:9:9
     const newPerson = new Person({
       userName: req.body.userName,
       password:
-        req.body.password != null
+        req.body.password == null
           ? CryptoJs.AES.encrypt(
               req.body.password,
killedBy: auth register route given the password does not exist should return a 500
statusReason: Error: expected 500 "Internal Server Error", got 200 "OK"

[Killed] ConditionalExpression
src/controllers/auth.controller.js:9:9
     const newPerson = new Person({
       userName: req.body.userName,
       password:
-        req.body.password != null
+        true
           ? CryptoJs.AES.encrypt(
               req.body.password,
killedBy: auth register route given the password does not exist should return a 500
statusReason: Error: expected 500 "Internal Server Error", got 200 "OK"

[Survived] StringLiteral
src/controllers/auth.controller.js:20:26
     // console.log(newPerson);
     const savePerson = await newPerson.save();
 
-    res.status(200).json('success');
+    res.status(200).json("");
   } catch (err) {
     // console.log(err);

[Timeout] BlockStatement
src/controllers/auth.controller.js:21:17
     const savePerson = await newPerson.save();
 
     res.status(200).json('success');
-  } catch (err) {
-    // console.log(err);
-    res.status(500).json(err);
-  }
+  } catch (err) {}
 }
 async function loginPerson(req, res) {

[Killed] BooleanLiteral
src/controllers/auth.controller.js:29:9
 async function loginPerson(req, res) {
   try {
     const user = await Person.findOne({ username: req.body.username });
-    if (!user) {
+    if (user) {
       res.status(401).json('Wrong Login Details');
       return;
killedBy: auth login route given the username not exist should return a 401
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 500

[Killed] ConditionalExpression
src/controllers/auth.controller.js:39:9
       process.env.SECRET,
     );
     const depassword = descryptedPass.toString(CryptoJs.enc.Utf8);
-    if (depassword !== req.body.password) {
+    if (true) {
       res.status(401).json('Wrong password');
       return;
killedBy: auth login route given a valid login request should return a 200 and a access token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Timeout] ObjectLiteral
src/controllers/auth.controller.js:46:7
     const { password, __v, createdAt, ...others } = user._doc;
 
     const userToken = jwt.sign(
-      {
-        id: user._id,
-        role: user.role,
-      },
+      {},
       process.env.SECRET,
       { expiresIn: '21d' },
