[Timeout] BlockStatement
src/controllers/category.controller.js:4:39
 const categoryService = require('../services/category.service.js');
 const Category = require('../models/Category.js');
 module.exports = {
-  createCategory: async (req, res) => {
-    try {
-      const category = req.body;
-      const newCategory = await categoryService.createNewCategory(category);
-      console.log(newCategory);
-      res.status(200).json(newCategory);
-    } catch (e) {
-      console.log(e);
-      res.status(500).json(e);
-    }
-  },
+  createCategory: async (req, res) => {},
   updateCategory: async (req, res) => {
     try {

[Timeout] BlockStatement
src/controllers/category.controller.js:5:9
 const Category = require('../models/Category.js');
 module.exports = {
   createCategory: async (req, res) => {
-    try {
-      const category = req.body;
-      const newCategory = await categoryService.createNewCategory(category);
-      console.log(newCategory);
-      res.status(200).json(newCategory);
-    } catch (e) {
+    try {} catch (e) {
       console.log(e);
       res.status(500).json(e);

[NoCoverage] BlockStatement
src/controllers/category.controller.js:15:39
       res.status(500).json(e);
     }
   },
-  updateCategory: async (req, res) => {
-    try {
-      const updateCategory = await categoryService.updateCategory(req.body);
-      res.status(200).json(updateCategory);
-    } catch (err) {
-      res.status(500).json(err);
-    }
-  },
+  updateCategory: async (req, res) => {},
   deleteCategory: async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controllers/category.controller.js:16:9
     }
   },
   updateCategory: async (req, res) => {
-    try {
-      const updateCategory = await categoryService.updateCategory(req.body);
-      res.status(200).json(updateCategory);
-    } catch (err) {
+    try {} catch (err) {
       res.status(500).json(err);
     }

[NoCoverage] BlockStatement
src/controllers/category.controller.js:19:19
     try {
       const updateCategory = await categoryService.updateCategory(req.body);
       res.status(200).json(updateCategory);
-    } catch (err) {
-      res.status(500).json(err);
-    }
+    } catch (err) {}
   },
   deleteCategory: async (req, res) => {

[NoCoverage] StringLiteral
src/controllers/category.controller.js:26:28
   deleteCategory: async (req, res) => {
     try {
       await Category.findByIdAndDelete(req.params.id);
-      res.status(200).json('Category successfully deleted');
+      res.status(200).json("");
     } catch (err) {
       res.status(500).json(err);

[Timeout] BlockStatement
src/controllers/category.controller.js:31:36
       res.status(500).json(err);
     }
   },
-  getCategory: async (req, res) => {
-    try {
-      const category = await Category.findById(req.params.id);
-      if (!category) {
-        res.status(404);
-        return;
-      } else res.status(200).json(category);
-    } catch (err) {
-      res.status(500).json('Hehe');
-    }
-  },
+  getCategory: async (req, res) => {},
   getAllCategorys: async (req, res) => {
     try {

[Timeout] BlockStatement
src/controllers/category.controller.js:32:9
     }
   },
   getCategory: async (req, res) => {
-    try {
-      const category = await Category.findById(req.params.id);
-      if (!category) {
-        res.status(404);
-        return;
-      } else res.status(200).json(category);
-    } catch (err) {
+    try {} catch (err) {
       res.status(500).json('Hehe');
     }

[Survived] ConditionalExpression
src/controllers/category.controller.js:34:11
   getCategory: async (req, res) => {
     try {
       const category = await Category.findById(req.params.id);
-      if (!category) {
+      if (false) {
         res.status(404);
         return;
