[NoCoverage] BlockStatement
src/controllers/product.controler.js:37:21
   getProduct: async (req, res) => {
     try {
       const product = await Product.findById(req.params.id);
-      if (!product) {
-        res.status(404).json('product not found');
-      } else res.status(200).json(product);
+      if (!product) {} else res.status(200).json(product);
     } catch (err) {
       res.status(500).json(err);

[Timeout] ConditionalExpression
src/controllers/product.controler.js:37:11
   getProduct: async (req, res) => {
     try {
       const product = await Product.findById(req.params.id);
-      if (!product) {
+      if (false) {
         res.status(404).json('product not found');
       } else res.status(200).json(product);
