[Timeout] ConditionalExpression
src/middlewares/verifyToken.js:9:11
   if (authHeader) {
     const token = authHeader.split(' ')[1];
     jwt.verify(token, process.env.JWT_SEC, async (err, person) => {
-      if (err) res.status(403).json('Invalid token' + err);
+      if (true) res.status(403).json('Invalid token' + err);
       req.person = person;
       // console.log(person);

[NoCoverage] BlockStatement
src/middlewares/verifyToken.js:19:44
   }
 };
 
-const verifyAndAdmin = (req, res, next) => {
-  verifyToken(req, res, () => {
-    if (req.person.role == 'ADMIN') {
-      next();
-    } else {
-      res.status(403).json('You are restricted from performing this operation');
-    }
-  });
-};
+const verifyAndAdmin = (req, res, next) => {};
 
 module.exports = { verifyToken, verifyAndAdmin };

[NoCoverage] BlockStatement
src/middlewares/verifyToken.js:20:31
 };
 
 const verifyAndAdmin = (req, res, next) => {
-  verifyToken(req, res, () => {
-    if (req.person.role == 'ADMIN') {
-      next();
-    } else {
-      res.status(403).json('You are restricted from performing this operation');
-    }
-  });
+  verifyToken(req, res, () => {});
 };
 

[NoCoverage] EqualityOperator
src/middlewares/verifyToken.js:21:9
 
 const verifyAndAdmin = (req, res, next) => {
   verifyToken(req, res, () => {
-    if (req.person.role == 'ADMIN') {
+    if (req.person.role != 'ADMIN') {
       next();
     } else {

[NoCoverage] ConditionalExpression
src/middlewares/verifyToken.js:21:9
 
 const verifyAndAdmin = (req, res, next) => {
   verifyToken(req, res, () => {
-    if (req.person.role == 'ADMIN') {
+    if (false) {
       next();
     } else {
