[NoCoverage] BlockStatement
src/controllers/user.controller.js:5:37
 const CryptoJs = require('crypto-js');
 
 module.exports = {
-  updatePerson: async (req, res) => {
-    if (req.body.password) {
-      req.body.password = CryptoJs.AES.encrypt(
-        req.body.password,
-        process.env.SECRET,
-      ).toString();
-    }
-    try {
-      await Person.findByIdAndUpdate(req.person.id, req.body);
-      const UpdatePerson = await Person.findById(req.person.id);
-      const { password, __v, createdAt, ...others } = UpdatePerson._doc;
-
-      res.status(200).json(others);
-    } catch (err) {
-      res.status(500).json({ err });
-    }
-  },
+  updatePerson: async (req, res) => {},
   // deletePerson: async (req, res) => {
   //   try {

[NoCoverage] BlockStatement
src/controllers/user.controller.js:6:28
 
 module.exports = {
   updatePerson: async (req, res) => {
-    if (req.body.password) {
-      req.body.password = CryptoJs.AES.encrypt(
-        req.body.password,
-        process.env.SECRET,
-      ).toString();
-    }
+    if (req.body.password) {}
     try {
       await Person.findByIdAndUpdate(req.person.id, req.body);

[NoCoverage] ConditionalExpression
src/controllers/user.controller.js:6:9
 
 module.exports = {
   updatePerson: async (req, res) => {
-    if (req.body.password) {
+    if (true) {
       req.body.password = CryptoJs.AES.encrypt(
         req.body.password,

[NoCoverage] BlockStatement
src/controllers/user.controller.js:12:9
         process.env.SECRET,
       ).toString();
     }
-    try {
-      await Person.findByIdAndUpdate(req.person.id, req.body);
-      const UpdatePerson = await Person.findById(req.person.id);
-      const { password, __v, createdAt, ...others } = UpdatePerson._doc;
-
-      res.status(200).json(others);
-    } catch (err) {
+    try {} catch (err) {
       res.status(500).json({ err });
     }

[NoCoverage] BlockStatement
src/controllers/user.controller.js:18:19
       const { password, __v, createdAt, ...others } = UpdatePerson._doc;
 
       res.status(200).json(others);
-    } catch (err) {
-      res.status(500).json({ err });
-    }
+    } catch (err) {}
   },
   // deletePerson: async (req, res) => {

[NoCoverage] ObjectLiteral
src/controllers/user.controller.js:19:28
 
       res.status(200).json(others);
     } catch (err) {
-      res.status(500).json({ err });
+      res.status(500).json({});
     }
   },
