[Timeout] BlockStatement
src/controllers/auth.controller.js:5:39
 const CryptoJs = require('crypto-js');
 const jwt = require('jsonwebtoken');
 const { createNewPerson } = require('../services/auth.service.js');
-async function createPerson(req, res) {
-  try {
-    const person = await createNewPerson(req.body);
-    delete person.password;
-    res.status(200).json(person);
-  } catch (err) {
-    // console.log(err);
-    res.status(500).json(err.message);
-  }
-}
+async function createPerson(req, res) {}
 async function loginPerson(req, res) {
   try {

[Timeout] BlockStatement
src/controllers/auth.controller.js:6:7
 const jwt = require('jsonwebtoken');
 const { createNewPerson } = require('../services/auth.service.js');
 async function createPerson(req, res) {
-  try {
-    const person = await createNewPerson(req.body);
-    delete person.password;
-    res.status(200).json(person);
-  } catch (err) {
+  try {} catch (err) {
     // console.log(err);
     res.status(500).json(err.message);

[Timeout] BlockStatement
src/controllers/auth.controller.js:10:17
     const person = await createNewPerson(req.body);
     delete person.password;
     res.status(200).json(person);
-  } catch (err) {
-    // console.log(err);
-    res.status(500).json(err.message);
-  }
+  } catch (err) {}
 }
 async function loginPerson(req, res) {

[Killed] ObjectLiteral
src/controllers/auth.controller.js:17:39
 }
 async function loginPerson(req, res) {
   try {
-    const user = await Person.findOne({ username: req.body.username });
+    const user = await Person.findOne({});
     if (!user) {
       res.status(401).json('Wrong Login Details');
killedBy: auth login route given a valid login request should return a 200 and a access token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] ConditionalExpression
src/controllers/auth.controller.js:18:9
 async function loginPerson(req, res) {
   try {
     const user = await Person.findOne({ username: req.body.username });
-    if (!user) {
+    if (false) {
       res.status(401).json('Wrong Login Details');
       return;
killedBy: auth login route given the username not exist should return a 401
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 500

[NoCoverage] BlockStatement
src/controllers/auth.controller.js:18:16
 async function loginPerson(req, res) {
   try {
     const user = await Person.findOne({ username: req.body.username });
-    if (!user) {
-      res.status(401).json('Wrong Login Details');
-      return;
-    }
+    if (!user) {}
 
     const descryptedPass = CryptoJs.AES.decrypt(

[Killed] EqualityOperator
src/controllers/auth.controller.js:28:9
       process.env.SECRET,
     );
     const depassword = descryptedPass.toString(CryptoJs.enc.Utf8);
-    if (depassword !== req.body.password) {
+    if (depassword === req.body.password) {
       res.status(401).json('Wrong password');
       return;
killedBy: auth login route given a valid login request should return a 200 and a access token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] ConditionalExpression
src/controllers/auth.controller.js:28:9
       process.env.SECRET,
     );
     const depassword = descryptedPass.toString(CryptoJs.enc.Utf8);
-    if (depassword !== req.body.password) {
+    if (false) {
       res.status(401).json('Wrong password');
       return;
killedBy: auth login route given a valid login request should return a 200 and a access token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Survived] StringLiteral
src/controllers/auth.controller.js:29:28
     );
     const depassword = descryptedPass.toString(CryptoJs.enc.Utf8);
     if (depassword !== req.body.password) {
-      res.status(401).json('Wrong password');
+      res.status(401).json("");
       return;
     }

[Killed] ObjectLiteral
src/controllers/auth.controller.js:40:7
         role: user.role,
       },
       process.env.SECRET,
-      { expiresIn: '21d' },
+      {},
     );
 
killedBy: auth login route given a valid login request should return a 200 and a access token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[NoCoverage] BlockStatement
src/controllers/auth.controller.js:44:15
     );
 
     res.status(200).json({ ...others, userToken });
-  } catch (e) {
-    // console.log(e);
-    res.status(500).json(e);
-  }
+  } catch (e) {}
 }
 module.exports = { createPerson, loginPerson };
