[Timeout] ConditionalExpression
src/services/category.service.js:5:11
 exports.createNewCategory = (category) => {
   return new Promise(async (resolve, reject) => {
     try {
-      if (category.type != undefined) {
+      if (true) {
         const newCategory = new Category(category);
         const saveCategory = await newCategory.save();

[NoCoverage] BlockStatement
src/services/category.service.js:17:52
     }
   });
 };
-exports.updateCategory = (categoryId, category) => {
-  return new Promise(async (resolve, reject) => {
-    try {
-      const updateCategory = await Category.findByIdAndUpdate(
-        categoryId,
-        {
-          $set: category,
-        },
-        { new: true },
-      );
-      const { __v, createdAt, updatedAt, ...others } = updateCategory._doc;
-      resolve(others);
-    } catch (e) {
-      reject(e);
-    }
-  });
-};
+exports.updateCategory = (categoryId, category) => {};
 exports.getListCategory = () => {
   return new Promise(async (resolve, reject) => {

[NoCoverage] BlockStatement
src/services/category.service.js:18:49
   });
 };
 exports.updateCategory = (categoryId, category) => {
-  return new Promise(async (resolve, reject) => {
-    try {
-      const updateCategory = await Category.findByIdAndUpdate(
-        categoryId,
-        {
-          $set: category,
-        },
-        { new: true },
-      );
-      const { __v, createdAt, updatedAt, ...others } = updateCategory._doc;
-      resolve(others);
-    } catch (e) {
-      reject(e);
-    }
-  });
+  return new Promise(async (resolve, reject) => {});
 };
 exports.getListCategory = () => {

[NoCoverage] BlockStatement
src/services/category.service.js:19:9
 };
 exports.updateCategory = (categoryId, category) => {
   return new Promise(async (resolve, reject) => {
-    try {
-      const updateCategory = await Category.findByIdAndUpdate(
-        categoryId,
-        {
-          $set: category,
-        },
-        { new: true },
-      );
-      const { __v, createdAt, updatedAt, ...others } = updateCategory._doc;
-      resolve(others);
-    } catch (e) {
+    try {} catch (e) {
       reject(e);
     }

[NoCoverage] BooleanLiteral
src/services/category.service.js:25:16
         {
           $set: category,
         },
-        { new: true },
+        { new: false },
       );
       const { __v, createdAt, updatedAt, ...others } = updateCategory._doc;

[NoCoverage] BlockStatement
src/services/category.service.js:29:17
       );
       const { __v, createdAt, updatedAt, ...others } = updateCategory._doc;
       resolve(others);
-    } catch (e) {
-      reject(e);
-    }
+    } catch (e) {}
   });
 };

[NoCoverage] BlockStatement
src/services/category.service.js:34:33
     }
   });
 };
-exports.getListCategory = () => {
-  return new Promise(async (resolve, reject) => {
-    try {
-      const allCategory = await Category.find()
-        .limit(10)
-        .sort({ startAt: 1 })
-        .exec();
-      resolve(allCategory);
-    } catch (e) {
-      reject(e);
-    }
-  });
-};
+exports.getListCategory = () => {};
 

[NoCoverage] BlockStatement
src/services/category.service.js:35:49
   });
 };
 exports.getListCategory = () => {
-  return new Promise(async (resolve, reject) => {
-    try {
-      const allCategory = await Category.find()
-        .limit(10)
-        .sort({ startAt: 1 })
-        .exec();
-      resolve(allCategory);
-    } catch (e) {
-      reject(e);
-    }
-  });
+  return new Promise(async (resolve, reject) => {});
 };
 

[NoCoverage] BlockStatement
src/services/category.service.js:36:9
 };
 exports.getListCategory = () => {
   return new Promise(async (resolve, reject) => {
-    try {
-      const allCategory = await Category.find()
-        .limit(10)
-        .sort({ startAt: 1 })
-        .exec();
-      resolve(allCategory);
-    } catch (e) {
+    try {} catch (e) {
       reject(e);
     }

[NoCoverage] MethodExpression
src/services/category.service.js:37:33
 exports.getListCategory = () => {
   return new Promise(async (resolve, reject) => {
     try {
-      const allCategory = await Category.find()
-        .limit(10)
-        .sort({ startAt: 1 })
+      const allCategory = await Category.find().limit(10)
         .exec();
       resolve(allCategory);
