[Timeout] BlockStatement
src/middlewares/verifyToken.js:3:41
 const jwt = require('jsonwebtoken');
 const Person = require('../models/Person');
-const verifyToken = (req, res, next) => {
-  const authHeader = req.headers.token;
-  // console.log(authHeader);
-  if (authHeader) {
-    const token = authHeader.split(' ')[1];
-    jwt.verify(token, process.env.JWT_SEC, async (err, person) => {
-      if (err) res.status(403).json('Invalid token' + err);
-      req.person = person;
-      // console.log(person);
-      next();
-    });
-  } else {
-    return res.status(401).json('You are not authenticated');
-  }
-};
+const verifyToken = (req, res, next) => {};
 
 const verifyAndAdmin = (req, res, next) => {

[Killed] ConditionalExpression
src/middlewares/verifyToken.js:6:7
 const verifyToken = (req, res, next) => {
   const authHeader = req.headers.token;
   // console.log(authHeader);
-  if (authHeader) {
+  if (false) {
     const token = authHeader.split(' ')[1];
     jwt.verify(token, process.env.JWT_SEC, async (err, person) => {
killedBy: category create category route given the user is logged in should return a 200 and create the category
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] ConditionalExpression
src/middlewares/verifyToken.js:6:7
 const verifyToken = (req, res, next) => {
   const authHeader = req.headers.token;
   // console.log(authHeader);
-  if (authHeader) {
+  if (true) {
     const token = authHeader.split(' ')[1];
     jwt.verify(token, process.env.JWT_SEC, async (err, person) => {
killedBy: category create category route given the user is not logged in should return a 403
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 500

[Timeout] BlockStatement
src/middlewares/verifyToken.js:8:67
   // console.log(authHeader);
   if (authHeader) {
     const token = authHeader.split(' ')[1];
-    jwt.verify(token, process.env.JWT_SEC, async (err, person) => {
-      if (err) res.status(403).json('Invalid token' + err);
-      req.person = person;
-      // console.log(person);
-      next();
-    });
+    jwt.verify(token, process.env.JWT_SEC, async (err, person) => {});
   } else {
     return res.status(401).json('You are not authenticated');

[Survived] ConditionalExpression
src/middlewares/verifyToken.js:9:11
   if (authHeader) {
     const token = authHeader.split(' ')[1];
     jwt.verify(token, process.env.JWT_SEC, async (err, person) => {
-      if (err) res.status(403).json('Invalid token' + err);
+      if (false) res.status(403).json('Invalid token' + err);
       req.person = person;
       // console.log(person);

[Timeout] BlockStatement
src/middlewares/verifyToken.js:14:10
       // console.log(person);
       next();
     });
-  } else {
-    return res.status(401).json('You are not authenticated');
-  }
+  } else {}
 };
 

[Survived] StringLiteral
src/middlewares/verifyToken.js:15:33
       next();
     });
   } else {
-    return res.status(401).json('You are not authenticated');
+    return res.status(401).json("");
   }
 };

[Timeout] BlockStatement
src/middlewares/verifyToken.js:19:44
   }
 };
 
-const verifyAndAdmin = (req, res, next) => {
-  verifyToken(req, res, () => {
-    if (req.person.role == 3) {
-      next();
-    } else {
-      res.status(403).json('You are restricted from performing this operation');
-    }
-  });
-};
+const verifyAndAdmin = (req, res, next) => {};
 
 module.exports = { verifyToken, verifyAndAdmin };

[Timeout] BlockStatement
src/middlewares/verifyToken.js:20:31
 };
 
 const verifyAndAdmin = (req, res, next) => {
-  verifyToken(req, res, () => {
-    if (req.person.role == 3) {
-      next();
-    } else {
-      res.status(403).json('You are restricted from performing this operation');
-    }
-  });
+  verifyToken(req, res, () => {});
 };
 

[Killed] ConditionalExpression
src/middlewares/verifyToken.js:21:9
 
 const verifyAndAdmin = (req, res, next) => {
   verifyToken(req, res, () => {
-    if (req.person.role == 3) {
+    if (false) {
       next();
     } else {
killedBy: category create category route given the user is logged in should return a 200 and create the category
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[Killed] ConditionalExpression
src/middlewares/verifyToken.js:21:9
 
 const verifyAndAdmin = (req, res, next) => {
   verifyToken(req, res, () => {
-    if (req.person.role == 3) {
+    if (true) {
       next();
     } else {
killedBy: user get all users given the user is not an admin should return a 401
statusReason: Error: expected 403 "Forbidden", got 200 "OK"

[Timeout] BlockStatement
src/middlewares/verifyToken.js:23:12
   verifyToken(req, res, () => {
     if (req.person.role == 3) {
       next();
-    } else {
-      res.status(403).json('You are restricted from performing this operation');
-    }
+    } else {}
   });
 };
