[Killed] BlockStatement
src/services/auth.service.js:6:30
 const jwt = require('jsonwebtoken');
 
 module.exports = {
-  createNewPerson: (user) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const newPerson = new Person({
-          userName: user.userName,
-          password:
-            user.password != null
-              ? CryptoJs.AES.encrypt(
-                  user.password,
-                  process.env.SECRET,
-                ).toString()
-              : '',
-          idRole: user.idRole,
-        });
-        // console.log(newPerson);
-        const savePerson = await newPerson.save();
-        resolve(savePerson);
-      } catch (err) {
-        reject(err);
-      }
-    });
-  },
+  createNewPerson: (user) => {},
 };
 
killedBy: auth register route given the valid register should return success and 200
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Timeout] BlockStatement
src/services/auth.service.js:7:51
 
 module.exports = {
   createNewPerson: (user) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const newPerson = new Person({
-          userName: user.userName,
-          password:
-            user.password != null
-              ? CryptoJs.AES.encrypt(
-                  user.password,
-                  process.env.SECRET,
-                ).toString()
-              : '',
-          idRole: user.idRole,
-        });
-        // console.log(newPerson);
-        const savePerson = await newPerson.save();
-        resolve(savePerson);
-      } catch (err) {
-        reject(err);
-      }
-    });
+    return new Promise(async (resolve, reject) => {});
   },
 };

[Timeout] BlockStatement
src/services/auth.service.js:8:11
 module.exports = {
   createNewPerson: (user) => {
     return new Promise(async (resolve, reject) => {
-      try {
-        const newPerson = new Person({
-          userName: user.userName,
-          password:
-            user.password != null
-              ? CryptoJs.AES.encrypt(
-                  user.password,
-                  process.env.SECRET,
-                ).toString()
-              : '',
-          idRole: user.idRole,
-        });
-        // console.log(newPerson);
-        const savePerson = await newPerson.save();
-        resolve(savePerson);
-      } catch (err) {
+      try {} catch (err) {
         reject(err);
       }

[Killed] ConditionalExpression
src/services/auth.service.js:12:13
         const newPerson = new Person({
           userName: user.userName,
           password:
-            user.password != null
+            true
               ? CryptoJs.AES.encrypt(
                   user.password,
killedBy: auth register route given the password does not exist should return a 500
statusReason: Error: expected 500 "Internal Server Error", got 200 "OK"

[Killed] EqualityOperator
src/services/auth.service.js:12:13
         const newPerson = new Person({
           userName: user.userName,
           password:
-            user.password != null
+            user.password == null
               ? CryptoJs.AES.encrypt(
                   user.password,
killedBy: auth register route given the password does not exist should return a 500
statusReason: Error: expected 500 "Internal Server Error", got 200 "OK"

[Killed] StringLiteral
src/services/auth.service.js:17:17
                   user.password,
                   process.env.SECRET,
                 ).toString()
-              : '',
+              : "Stryker was here!",
           idRole: user.idRole,
         });
killedBy: auth register route given the password does not exist should return a 500
statusReason: Error: expected 500 "Internal Server Error", got 200 "OK"

[Timeout] BlockStatement
src/services/auth.service.js:23:21
         // console.log(newPerson);
         const savePerson = await newPerson.save();
         resolve(savePerson);
-      } catch (err) {
-        reject(err);
-      }
+      } catch (err) {}
     });
   },
