[Timeout] BlockStatement
src/controllers/category.controller.js:4:39
 const categoryService = require('../services/category.service.js');
 const Category = require('../models/Category.js');
 module.exports = {
-  createCategory: async (req, res) => {
-    try {
-      const category = req.body;
-      const newCategory = await categoryService.createNewCategory(category);
-      // console.log(newCategory);
-      res.status(200).json(newCategory);
-    } catch (e) {
-      console.log(e);
-      res.status(500).json(e);
-    }
-  },
+  createCategory: async (req, res) => {},
   updateCategory: async (req, res) => {
     try {

[Timeout] BlockStatement
src/controllers/category.controller.js:5:9
 const Category = require('../models/Category.js');
 module.exports = {
   createCategory: async (req, res) => {
-    try {
-      const category = req.body;
-      const newCategory = await categoryService.createNewCategory(category);
-      // console.log(newCategory);
-      res.status(200).json(newCategory);
-    } catch (e) {
+    try {} catch (e) {
       console.log(e);
       res.status(500).json(e);

[NoCoverage] BlockStatement
src/controllers/category.controller.js:10:17
       const newCategory = await categoryService.createNewCategory(category);
       // console.log(newCategory);
       res.status(200).json(newCategory);
-    } catch (e) {
-      console.log(e);
-      res.status(500).json(e);
-    }
+    } catch (e) {}
   },
   updateCategory: async (req, res) => {

[Timeout] BlockStatement
src/controllers/category.controller.js:15:39
       res.status(500).json(e);
     }
   },
-  updateCategory: async (req, res) => {
-    try {
-      console.log(req.body);
-      const updateCategory = await categoryService.updateCategory(
-        req.params.id,
-        req.body,
-      );
-      res.status(200).json(updateCategory);
-    } catch (err) {
-      console.log(err);
-      res.status(500).json({ message: err.toString() });
-    }
-  },
+  updateCategory: async (req, res) => {},
   deleteCategory: async (req, res) => {
     try {

[Timeout] BlockStatement
src/controllers/category.controller.js:16:9
     }
   },
   updateCategory: async (req, res) => {
-    try {
-      console.log(req.body);
-      const updateCategory = await categoryService.updateCategory(
-        req.params.id,
-        req.body,
-      );
-      res.status(200).json(updateCategory);
-    } catch (err) {
+    try {} catch (err) {
       console.log(err);
       res.status(500).json({ message: err.toString() });

[NoCoverage] BlockStatement
src/controllers/category.controller.js:23:19
         req.body,
       );
       res.status(200).json(updateCategory);
-    } catch (err) {
-      console.log(err);
-      res.status(500).json({ message: err.toString() });
-    }
+    } catch (err) {}
   },
   deleteCategory: async (req, res) => {

[NoCoverage] BlockStatement
src/controllers/category.controller.js:28:39
       res.status(500).json({ message: err.toString() });
     }
   },
-  deleteCategory: async (req, res) => {
-    try {
-      await Category.findByIdAndDelete(req.params.id);
-      res.status(200).json('Category successfully deleted');
-    } catch (err) {
-      res.status(500).json(err);
-    }
-  },
+  deleteCategory: async (req, res) => {},
   getCategory: async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controllers/category.controller.js:29:9
     }
   },
   deleteCategory: async (req, res) => {
-    try {
-      await Category.findByIdAndDelete(req.params.id);
-      res.status(200).json('Category successfully deleted');
-    } catch (err) {
+    try {} catch (err) {
       res.status(500).json(err);
     }

[NoCoverage] BlockStatement
src/controllers/category.controller.js:32:19
     try {
       await Category.findByIdAndDelete(req.params.id);
       res.status(200).json('Category successfully deleted');
-    } catch (err) {
-      res.status(500).json(err);
-    }
+    } catch (err) {}
   },
   getCategory: async (req, res) => {

[Timeout] BlockStatement
src/controllers/category.controller.js:36:36
       res.status(500).json(err);
     }
   },
-  getCategory: async (req, res) => {
-    try {
-      const category = await Category.findById(req.params.id);
-      if (!category) {
-        res.status(404).json('category not found');
-        return;
-      } else res.status(200).json(category);
-    } catch (err) {
-      res.status(500).json('Hehe');
-    }
-  },
+  getCategory: async (req, res) => {},
   getAllCategorys: async (req, res) => {
     try {

[Timeout] BlockStatement
src/controllers/category.controller.js:37:9
     }
   },
   getCategory: async (req, res) => {
-    try {
-      const category = await Category.findById(req.params.id);
-      if (!category) {
-        res.status(404).json('category not found');
-        return;
-      } else res.status(200).json(category);
-    } catch (err) {
+    try {} catch (err) {
       res.status(500).json('Hehe');
     }

[Killed] BooleanLiteral
src/controllers/category.controller.js:39:11
   getCategory: async (req, res) => {
     try {
       const category = await Category.findById(req.params.id);
-      if (!category) {
+      if (category) {
         res.status(404).json('category not found');
         return;
killedBy: category get category route given the category does exist should return a 200 status and the category
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/controllers/category.controller.js:39:11
   getCategory: async (req, res) => {
     try {
       const category = await Category.findById(req.params.id);
-      if (!category) {
+      if (true) {
         res.status(404).json('category not found');
         return;
killedBy: category get category route given the category does exist should return a 200 status and the category
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Timeout] BlockStatement
src/controllers/category.controller.js:43:19
         res.status(404).json('category not found');
         return;
       } else res.status(200).json(category);
-    } catch (err) {
-      res.status(500).json('Hehe');
-    }
+    } catch (err) {}
   },
   getAllCategorys: async (req, res) => {

[Survived] StringLiteral
src/controllers/category.controller.js:44:28
         return;
       } else res.status(200).json(category);
     } catch (err) {
-      res.status(500).json('Hehe');
+      res.status(500).json("");
     }
   },

[Timeout] BlockStatement
src/controllers/category.controller.js:47:40
       res.status(500).json('Hehe');
     }
   },
-  getAllCategorys: async (req, res) => {
-    try {
-      const listCategory = await categoryService.getListCategory();
-      res.status(200).json(listCategory);
-    } catch (err) {
-      res.status(500).json(err);
-    }
-  },
+  getAllCategorys: async (req, res) => {},
 };
 

[Timeout] BlockStatement
src/controllers/category.controller.js:48:9
     }
   },
   getAllCategorys: async (req, res) => {
-    try {
-      const listCategory = await categoryService.getListCategory();
-      res.status(200).json(listCategory);
-    } catch (err) {
+    try {} catch (err) {
       res.status(500).json(err);
     }

[NoCoverage] BlockStatement
src/controllers/category.controller.js:51:19
     try {
       const listCategory = await categoryService.getListCategory();
       res.status(200).json(listCategory);
-    } catch (err) {
-      res.status(500).json(err);
-    }
+    } catch (err) {}
   },
 };
