[Timeout] BlockStatement
src/controllers/discount.controller.js:4:50
 const discountService = require('../services/discount.service');
 
 module.exports = {
-  getAllDiscountsController: async (req, res) => {
-    try {
-      const discounts = await discountService.getAllDiscounts();
-      return discounts
-        ? res.status(200).json(discounts)
-        : res.status(404).json('Discounts are not found');
-    } catch (error) {
-      console.error(error.message);
-      return res.status(500).json(error.message);
-    }
-  },
+  getAllDiscountsController: async (req, res) => {},
   getDiscountByIdController: async (req, res) => {
     try {

[Timeout] BlockStatement
src/controllers/discount.controller.js:5:9
 
 module.exports = {
   getAllDiscountsController: async (req, res) => {
-    try {
-      const discounts = await discountService.getAllDiscounts();
-      return discounts
-        ? res.status(200).json(discounts)
-        : res.status(404).json('Discounts are not found');
-    } catch (error) {
+    try {} catch (error) {
       console.error(error.message);
       return res.status(500).json(error.message);

[NoCoverage] BlockStatement
src/controllers/discount.controller.js:10:21
       return discounts
         ? res.status(200).json(discounts)
         : res.status(404).json('Discounts are not found');
-    } catch (error) {
-      console.error(error.message);
-      return res.status(500).json(error.message);
-    }
+    } catch (error) {}
   },
   getDiscountByIdController: async (req, res) => {

[NoCoverage] BlockStatement
src/controllers/discount.controller.js:15:50
       return res.status(500).json(error.message);
     }
   },
-  getDiscountByIdController: async (req, res) => {
-    try {
-      const discountId = req.params.discountId;
-      const discount = await discountService.getDiscountById(discountId);
-      return discount
-        ? res.status(200).json(discount)
-        : res.status(404).json('Discount is not found');
-    } catch (error) {
-      console.error(error.message);
-      return res.status(500).json(error.message);
-    }
-  },
+  getDiscountByIdController: async (req, res) => {},
   createNewDiscountController: async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controllers/discount.controller.js:16:9
     }
   },
   getDiscountByIdController: async (req, res) => {
-    try {
-      const discountId = req.params.discountId;
-      const discount = await discountService.getDiscountById(discountId);
-      return discount
-        ? res.status(200).json(discount)
-        : res.status(404).json('Discount is not found');
-    } catch (error) {
+    try {} catch (error) {
       console.error(error.message);
       return res.status(500).json(error.message);

[NoCoverage] StringLiteral
src/controllers/discount.controller.js:21:32
       const discount = await discountService.getDiscountById(discountId);
       return discount
         ? res.status(200).json(discount)
-        : res.status(404).json('Discount is not found');
+        : res.status(404).json("");
     } catch (error) {
       console.error(error.message);

[NoCoverage] BlockStatement
src/controllers/discount.controller.js:22:21
       return discount
         ? res.status(200).json(discount)
         : res.status(404).json('Discount is not found');
-    } catch (error) {
-      console.error(error.message);
-      return res.status(500).json(error.message);
-    }
+    } catch (error) {}
   },
   createNewDiscountController: async (req, res) => {

[NoCoverage] BlockStatement
src/controllers/discount.controller.js:27:52
       return res.status(500).json(error.message);
     }
   },
-  createNewDiscountController: async (req, res) => {
-    try {
-      const discountInfo = req.body;
-      const newDiscount = await discountService.createNewDiscount(discountInfo);
-      return newDiscount
-        ? res.status(201).json(newDiscount)
-        : res.status(400).json('Can not create new discount');
-    } catch (error) {
-      console.error(error.message);
-      return res.status(500).json(error.message);
-    }
-  },
+  createNewDiscountController: async (req, res) => {},
   updateDiscountController: async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controllers/discount.controller.js:28:9
     }
   },
   createNewDiscountController: async (req, res) => {
-    try {
-      const discountInfo = req.body;
-      const newDiscount = await discountService.createNewDiscount(discountInfo);
-      return newDiscount
-        ? res.status(201).json(newDiscount)
-        : res.status(400).json('Can not create new discount');
-    } catch (error) {
+    try {} catch (error) {
       console.error(error.message);
       return res.status(500).json(error.message);

[NoCoverage] BlockStatement
src/controllers/discount.controller.js:34:21
       return newDiscount
         ? res.status(201).json(newDiscount)
         : res.status(400).json('Can not create new discount');
-    } catch (error) {
-      console.error(error.message);
-      return res.status(500).json(error.message);
-    }
+    } catch (error) {}
   },
   updateDiscountController: async (req, res) => {

[NoCoverage] BlockStatement
src/controllers/discount.controller.js:39:49
       return res.status(500).json(error.message);
     }
   },
-  updateDiscountController: async (req, res) => {
-    try {
-      const discountId = req.params.discountId;
-      const newDiscountInfo = req.body;
-      const newDiscount = await discountService.updateDiscount(
-        discountId,
-        newDiscountInfo,
-      );
-      return newDiscount
-        ? res.status(200).json(newDiscount)
-        : res.status(400).json('Can not update new discount');
-    } catch (error) {
-      console.error(error.message);
-      return res.status(500).json(error.message);
-    }
-  },
+  updateDiscountController: async (req, res) => {},
   deleteDiscountController: async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controllers/discount.controller.js:40:9
     }
   },
   updateDiscountController: async (req, res) => {
-    try {
-      const discountId = req.params.discountId;
-      const newDiscountInfo = req.body;
-      const newDiscount = await discountService.updateDiscount(
-        discountId,
-        newDiscountInfo,
-      );
-      return newDiscount
-        ? res.status(200).json(newDiscount)
-        : res.status(400).json('Can not update new discount');
-    } catch (error) {
+    try {} catch (error) {
       console.error(error.message);
       return res.status(500).json(error.message);

[NoCoverage] BlockStatement
src/controllers/discount.controller.js:50:21
       return newDiscount
         ? res.status(200).json(newDiscount)
         : res.status(400).json('Can not update new discount');
-    } catch (error) {
-      console.error(error.message);
-      return res.status(500).json(error.message);
-    }
+    } catch (error) {}
   },
   deleteDiscountController: async (req, res) => {

[NoCoverage] BlockStatement
src/controllers/discount.controller.js:55:49
       return res.status(500).json(error.message);
     }
   },
-  deleteDiscountController: async (req, res) => {
-    try {
-      const discountId = req.params.discountId;
-      const deletedDiscount = await discountService.deleteDiscount(discountId);
-      return deletedDiscount
-        ? res.status(200).json(deletedDiscount)
-        : res.status(400).json('Can not delete discount');
-    } catch (error) {
-      console.error(error.message);
-      return res.status(500).json(error.message);
-    }
-  },
+  deleteDiscountController: async (req, res) => {},
 };
 

[NoCoverage] BlockStatement
src/controllers/discount.controller.js:56:9
     }
   },
   deleteDiscountController: async (req, res) => {
-    try {
-      const discountId = req.params.discountId;
-      const deletedDiscount = await discountService.deleteDiscount(discountId);
-      return deletedDiscount
-        ? res.status(200).json(deletedDiscount)
-        : res.status(400).json('Can not delete discount');
-    } catch (error) {
+    try {} catch (error) {
       console.error(error.message);
       return res.status(500).json(error.message);

[NoCoverage] StringLiteral
src/controllers/discount.controller.js:61:32
       const deletedDiscount = await discountService.deleteDiscount(discountId);
       return deletedDiscount
         ? res.status(200).json(deletedDiscount)
-        : res.status(400).json('Can not delete discount');
+        : res.status(400).json("");
     } catch (error) {
       console.error(error.message);

[NoCoverage] BlockStatement
src/controllers/discount.controller.js:62:21
       return deletedDiscount
         ? res.status(200).json(deletedDiscount)
         : res.status(400).json('Can not delete discount');
-    } catch (error) {
-      console.error(error.message);
-      return res.status(500).json(error.message);
-    }
+    } catch (error) {}
   },
 };
