[NoCoverage] BlockStatement
src/controllers/listOfProductBuy.controller.js:4:61
 const ListOfProductBuyService = require('../services/listOfProductBuy.service');
 
 module.exports = {
-  getListOfProductOfCustomerController: async (req, res) => {
-    try {
-      const idCustomer = req.params.idCustomer;
-      const listOfProducts =
-        await ListOfProductBuyService.getListOfProductOfCustomer(idCustomer);
-      return res.status(200).send(listOfProducts);
-    } catch (error) {
-      console.error(error.message);
-      return res.status(500).send('Something went wrong');
-    }
-  },
+  getListOfProductOfCustomerController: async (req, res) => {},
   createNewListProductBuyController: async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controllers/listOfProductBuy.controller.js:5:9
 
 module.exports = {
   getListOfProductOfCustomerController: async (req, res) => {
-    try {
-      const idCustomer = req.params.idCustomer;
-      const listOfProducts =
-        await ListOfProductBuyService.getListOfProductOfCustomer(idCustomer);
-      return res.status(200).send(listOfProducts);
-    } catch (error) {
+    try {} catch (error) {
       console.error(error.message);
       return res.status(500).send('Something went wrong');

[NoCoverage] BlockStatement
src/controllers/listOfProductBuy.controller.js:10:21
       const listOfProducts =
         await ListOfProductBuyService.getListOfProductOfCustomer(idCustomer);
       return res.status(200).send(listOfProducts);
-    } catch (error) {
-      console.error(error.message);
-      return res.status(500).send('Something went wrong');
-    }
+    } catch (error) {}
   },
   createNewListProductBuyController: async (req, res) => {

[NoCoverage] BlockStatement
src/controllers/listOfProductBuy.controller.js:15:58
       return res.status(500).send('Something went wrong');
     }
   },
-  createNewListProductBuyController: async (req, res) => {
-    try {
-      const listOfProductsInfo = req.body;
-      const newListOfProducts =
-        await ListOfProductBuyService.createNewListProductBuy(
-          listOfProductsInfo,
-        );
-      return res.status(200).send(newListOfProducts);
-    } catch (error) {
-      console.error(error.message);
-      return res.status(500).send('Something went wrong');
-    }
-  },
+  createNewListProductBuyController: async (req, res) => {},
   updateListProductBuyController: async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controllers/listOfProductBuy.controller.js:16:9
     }
   },
   createNewListProductBuyController: async (req, res) => {
-    try {
-      const listOfProductsInfo = req.body;
-      const newListOfProducts =
-        await ListOfProductBuyService.createNewListProductBuy(
-          listOfProductsInfo,
-        );
-      return res.status(200).send(newListOfProducts);
-    } catch (error) {
+    try {} catch (error) {
       console.error(error.message);
       return res.status(500).send('Something went wrong');

[NoCoverage] BlockStatement
src/controllers/listOfProductBuy.controller.js:23:21
           listOfProductsInfo,
         );
       return res.status(200).send(newListOfProducts);
-    } catch (error) {
-      console.error(error.message);
-      return res.status(500).send('Something went wrong');
-    }
+    } catch (error) {}
   },
   updateListProductBuyController: async (req, res) => {

[NoCoverage] BlockStatement
src/controllers/listOfProductBuy.controller.js:28:55
       return res.status(500).send('Something went wrong');
     }
   },
-  updateListProductBuyController: async (req, res) => {
-    try {
-      const idListOfProduct = req.params.idListOfProduct;
-      const listOfProductsInfo = req.body;
-      const updatedListProductBuy =
-        await ListOfProductBuyService.updateListProductBuy(
-          idListOfProduct,
-          listOfProductsInfo,
-        );
-      resolve(updatedListProductBuy);
-    } catch (error) {
-      reject(error);
-    }
-  },
+  updateListProductBuyController: async (req, res) => {},
   deleteListProductBuy: async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controllers/listOfProductBuy.controller.js:29:9
     }
   },
   updateListProductBuyController: async (req, res) => {
-    try {
-      const idListOfProduct = req.params.idListOfProduct;
-      const listOfProductsInfo = req.body;
-      const updatedListProductBuy =
-        await ListOfProductBuyService.updateListProductBuy(
-          idListOfProduct,
-          listOfProductsInfo,
-        );
-      resolve(updatedListProductBuy);
-    } catch (error) {
+    try {} catch (error) {
       reject(error);
     }

[NoCoverage] BlockStatement
src/controllers/listOfProductBuy.controller.js:38:21
           listOfProductsInfo,
         );
       resolve(updatedListProductBuy);
-    } catch (error) {
-      reject(error);
-    }
+    } catch (error) {}
   },
   deleteListProductBuy: async (req, res) => {

[NoCoverage] BlockStatement
src/controllers/listOfProductBuy.controller.js:42:45
       reject(error);
     }
   },
-  deleteListProductBuy: async (req, res) => {
-    try {
-      const idListOfProduct = req.params.idListOfProduct;
-      const deleteProductBuyController =
-        await ListOfProductBuyService.deleteListProductBuy(idListOfProduct);
-      resolve(deleteProductBuyController);
-    } catch (error) {
-      reject(error);
-    }
-  },
+  deleteListProductBuy: async (req, res) => {},
 };
 

[NoCoverage] BlockStatement
src/controllers/listOfProductBuy.controller.js:43:9
     }
   },
   deleteListProductBuy: async (req, res) => {
-    try {
-      const idListOfProduct = req.params.idListOfProduct;
-      const deleteProductBuyController =
-        await ListOfProductBuyService.deleteListProductBuy(idListOfProduct);
-      resolve(deleteProductBuyController);
-    } catch (error) {
+    try {} catch (error) {
       reject(error);
     }

[NoCoverage] BlockStatement
src/controllers/listOfProductBuy.controller.js:48:21
       const deleteProductBuyController =
         await ListOfProductBuyService.deleteListProductBuy(idListOfProduct);
       resolve(deleteProductBuyController);
-    } catch (error) {
-      reject(error);
-    }
+    } catch (error) {}
   },
 };
