[Timeout] BlockStatement
src/controllers/product.controler.js:4:38
 const productService = require('../services/product.service.js');
 const Product = require('../models/Product.js');
 module.exports = {
-  createProduct: async (req, res) => {
-    try {
-      const product = req.body;
-      const newProduct = await productService.createNewProduct(product);
-      res.status(200).json(newProduct);
-    } catch (e) {
-      console.log(e);
-      res.status(500).json(e);
-    }
-  },
+  createProduct: async (req, res) => {},
   updateProduct: async (req, res) => {
     try {

[Timeout] BlockStatement
src/controllers/product.controler.js:5:9
 const Product = require('../models/Product.js');
 module.exports = {
   createProduct: async (req, res) => {
-    try {
-      const product = req.body;
-      const newProduct = await productService.createNewProduct(product);
-      res.status(200).json(newProduct);
-    } catch (e) {
+    try {} catch (e) {
       console.log(e);
       res.status(500).json(e);

[NoCoverage] BlockStatement
src/controllers/product.controler.js:9:17
       const product = req.body;
       const newProduct = await productService.createNewProduct(product);
       res.status(200).json(newProduct);
-    } catch (e) {
-      console.log(e);
-      res.status(500).json(e);
-    }
+    } catch (e) {}
   },
   updateProduct: async (req, res) => {

[Timeout] BlockStatement
src/controllers/product.controler.js:14:38
       res.status(500).json(e);
     }
   },
-  updateProduct: async (req, res) => {
-    try {
-      const updateProduct = await productService.updateProduct(
-        req.params.id,
-        req.body,
-      );
-      res.status(200).json(updateProduct);
-    } catch (err) {
-      console.log('Update' + err);
-      res.status(500).json(err);
-    }
-  },
+  updateProduct: async (req, res) => {},
   deleteProduct: async (req, res) => {
     try {

[Timeout] BlockStatement
src/controllers/product.controler.js:15:9
     }
   },
   updateProduct: async (req, res) => {
-    try {
-      const updateProduct = await productService.updateProduct(
-        req.params.id,
-        req.body,
-      );
-      res.status(200).json(updateProduct);
-    } catch (err) {
+    try {} catch (err) {
       console.log('Update' + err);
       res.status(500).json(err);

[NoCoverage] BlockStatement
src/controllers/product.controler.js:21:19
         req.body,
       );
       res.status(200).json(updateProduct);
-    } catch (err) {
-      console.log('Update' + err);
-      res.status(500).json(err);
-    }
+    } catch (err) {}
   },
   deleteProduct: async (req, res) => {

[NoCoverage] StringLiteral
src/controllers/product.controler.js:22:19
       );
       res.status(200).json(updateProduct);
     } catch (err) {
-      console.log('Update' + err);
+      console.log("" + err);
       res.status(500).json(err);
     }

[Timeout] BlockStatement
src/controllers/product.controler.js:26:38
       res.status(500).json(err);
     }
   },
-  deleteProduct: async (req, res) => {
-    try {
-      await Product.findByIdAndDelete(req.params.id);
-      res.status(200).json('Product successfully deleted');
-    } catch (err) {
-      res.status(500).json(err);
-    }
-  },
+  deleteProduct: async (req, res) => {},
   getProduct: async (req, res) => {
     try {

[Timeout] BlockStatement
src/controllers/product.controler.js:27:9
     }
   },
   deleteProduct: async (req, res) => {
-    try {
-      await Product.findByIdAndDelete(req.params.id);
-      res.status(200).json('Product successfully deleted');
-    } catch (err) {
+    try {} catch (err) {
       res.status(500).json(err);
     }

[NoCoverage] BlockStatement
src/controllers/product.controler.js:30:19
     try {
       await Product.findByIdAndDelete(req.params.id);
       res.status(200).json('Product successfully deleted');
-    } catch (err) {
-      res.status(500).json(err);
-    }
+    } catch (err) {}
   },
   getProduct: async (req, res) => {

[Timeout] BlockStatement
src/controllers/product.controler.js:34:35
       res.status(500).json(err);
     }
   },
-  getProduct: async (req, res) => {
-    try {
-      const product = await Product.findById(req.params.id);
-      if (!product) {
-        res.status(404).json('product not found');
-      } else res.status(200).json(product);
-    } catch (err) {
-      res.status(500).json(err);
-    }
-  },
+  getProduct: async (req, res) => {},
   getAllProducts: async (req, res) => {
     try {

[Timeout] BlockStatement
src/controllers/product.controler.js:35:9
     }
   },
   getProduct: async (req, res) => {
-    try {
-      const product = await Product.findById(req.params.id);
-      if (!product) {
-        res.status(404).json('product not found');
-      } else res.status(200).json(product);
-    } catch (err) {
+    try {} catch (err) {
       res.status(500).json(err);
     }

[Killed] ConditionalExpression
src/controllers/product.controler.js:37:11
   getProduct: async (req, res) => {
     try {
       const product = await Product.findById(req.params.id);
-      if (!product) {
+      if (true) {
         res.status(404).json('product not found');
       } else res.status(200).json(product);
killedBy: product get product route given the product does exist should return a 200 status and the product
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BooleanLiteral
src/controllers/product.controler.js:37:11
   getProduct: async (req, res) => {
     try {
       const product = await Product.findById(req.params.id);
-      if (!product) {
+      if (product) {
         res.status(404).json('product not found');
       } else res.status(200).json(product);
killedBy: product get product route given the product does exist should return a 200 status and the product
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Timeout] BlockStatement
src/controllers/product.controler.js:40:19
       if (!product) {
         res.status(404).json('product not found');
       } else res.status(200).json(product);
-    } catch (err) {
-      res.status(500).json(err);
-    }
+    } catch (err) {}
   },
   getAllProducts: async (req, res) => {

[Timeout] BlockStatement
src/controllers/product.controler.js:44:39
       res.status(500).json(err);
     }
   },
-  getAllProducts: async (req, res) => {
-    try {
-      const listProduct = await productService.getListProduct();
-      res.status(200).json(listProduct);
-    } catch (err) {
-      res.status(500).json(err);
-    }
-  },
+  getAllProducts: async (req, res) => {},
 };
 

[Timeout] BlockStatement
src/controllers/product.controler.js:45:9
     }
   },
   getAllProducts: async (req, res) => {
-    try {
-      const listProduct = await productService.getListProduct();
-      res.status(200).json(listProduct);
-    } catch (err) {
+    try {} catch (err) {
       res.status(500).json(err);
     }

[NoCoverage] BlockStatement
src/controllers/product.controler.js:48:19
     try {
       const listProduct = await productService.getListProduct();
       res.status(200).json(listProduct);
-    } catch (err) {
-      res.status(500).json(err);
-    }
+    } catch (err) {}
   },
 };
