[Timeout] BlockStatement
src/controllers/user.controller.js:5:37
 const CryptoJs = require('crypto-js');
 
 module.exports = {
-  updatePerson: async (req, res) => {
-    try {
-      if (req.body.password) {
-        req.body.password = CryptoJs.AES.encrypt(
-          req.body.password,
-          process.env.SECRET,
-        ).toString();
-      }
-      const userInfo = await Person.findById(req.person.id);
-      if (req.body.cmnd_passport && userInfo.cmnd_passport) {
-        delete req.body.cmnd_passport;
-      }
-      if (req.body.idRole) delete req.body.idRole;
-      const UpdatePerson = await Person.findByIdAndUpdate(req.person.id, {
-        $set: req.body,
-      });
-      const { password, __v, createdAt, ...others } = UpdatePerson._doc;
-
-      res.status(200).json(others);
-    } catch (err) {
-      console.log(err.message);
-      res.status(500).json({ message: err.message });
-    }
-  },
+  updatePerson: async (req, res) => {},
   // banPerson: async (req, res) => {
   //   try {

[Timeout] BlockStatement
src/controllers/user.controller.js:6:9
 
 module.exports = {
   updatePerson: async (req, res) => {
-    try {
-      if (req.body.password) {
-        req.body.password = CryptoJs.AES.encrypt(
-          req.body.password,
-          process.env.SECRET,
-        ).toString();
-      }
-      const userInfo = await Person.findById(req.person.id);
-      if (req.body.cmnd_passport && userInfo.cmnd_passport) {
-        delete req.body.cmnd_passport;
-      }
-      if (req.body.idRole) delete req.body.idRole;
-      const UpdatePerson = await Person.findByIdAndUpdate(req.person.id, {
-        $set: req.body,
-      });
-      const { password, __v, createdAt, ...others } = UpdatePerson._doc;
-
-      res.status(200).json(others);
-    } catch (err) {
+    try {} catch (err) {
       console.log(err.message);
       res.status(500).json({ message: err.message });

[Survived] ConditionalExpression
src/controllers/user.controller.js:7:11
 module.exports = {
   updatePerson: async (req, res) => {
     try {
-      if (req.body.password) {
+      if (true) {
         req.body.password = CryptoJs.AES.encrypt(
           req.body.password,

[Survived] BlockStatement
src/controllers/user.controller.js:7:30
 module.exports = {
   updatePerson: async (req, res) => {
     try {
-      if (req.body.password) {
-        req.body.password = CryptoJs.AES.encrypt(
-          req.body.password,
-          process.env.SECRET,
-        ).toString();
-      }
+      if (req.body.password) {}
       const userInfo = await Person.findById(req.person.id);
       if (req.body.cmnd_passport && userInfo.cmnd_passport) {

[Survived] ConditionalExpression
src/controllers/user.controller.js:14:11
         ).toString();
       }
       const userInfo = await Person.findById(req.person.id);
-      if (req.body.cmnd_passport && userInfo.cmnd_passport) {
+      if (false) {
         delete req.body.cmnd_passport;
       }

[Survived] ConditionalExpression
src/controllers/user.controller.js:14:11
         ).toString();
       }
       const userInfo = await Person.findById(req.person.id);
-      if (req.body.cmnd_passport && userInfo.cmnd_passport) {
+      if (true) {
         delete req.body.cmnd_passport;
       }

[Survived] ConditionalExpression
src/controllers/user.controller.js:17:11
       if (req.body.cmnd_passport && userInfo.cmnd_passport) {
         delete req.body.cmnd_passport;
       }
-      if (req.body.idRole) delete req.body.idRole;
+      if (false) delete req.body.idRole;
       const UpdatePerson = await Person.findByIdAndUpdate(req.person.id, {
         $set: req.body,

[Survived] ConditionalExpression
src/controllers/user.controller.js:17:11
       if (req.body.cmnd_passport && userInfo.cmnd_passport) {
         delete req.body.cmnd_passport;
       }
-      if (req.body.idRole) delete req.body.idRole;
+      if (true) delete req.body.idRole;
       const UpdatePerson = await Person.findByIdAndUpdate(req.person.id, {
         $set: req.body,

[NoCoverage] BlockStatement
src/controllers/user.controller.js:24:19
       const { password, __v, createdAt, ...others } = UpdatePerson._doc;
 
       res.status(200).json(others);
-    } catch (err) {
-      console.log(err.message);
-      res.status(500).json({ message: err.message });
-    }
+    } catch (err) {}
   },
   // banPerson: async (req, res) => {

[Timeout] BlockStatement
src/controllers/user.controller.js:37:35
   //     res.status(500).json(er);
   //   }
   // },
-  getProfile: async (req, res) => {
-    try {
-      const person = await Person.findById(req.person.id);
-      const { password, __v, createdAt, ...personData } = person._doc;
-      res.status(200).json(personData);
-    } catch (err) {
-      res.status(500).json(err.message);
-    }
-  },
+  getProfile: async (req, res) => {},
   getAllPersons: async (req, res) => {
     try {

[Timeout] BlockStatement
src/controllers/user.controller.js:38:9
   //   }
   // },
   getProfile: async (req, res) => {
-    try {
-      const person = await Person.findById(req.person.id);
-      const { password, __v, createdAt, ...personData } = person._doc;
-      res.status(200).json(personData);
-    } catch (err) {
+    try {} catch (err) {
       res.status(500).json(err.message);
     }

[NoCoverage] BlockStatement
src/controllers/user.controller.js:42:19
       const person = await Person.findById(req.person.id);
       const { password, __v, createdAt, ...personData } = person._doc;
       res.status(200).json(personData);
-    } catch (err) {
-      res.status(500).json(err.message);
-    }
+    } catch (err) {}
   },
   getAllPersons: async (req, res) => {

[Timeout] BlockStatement
src/controllers/user.controller.js:46:38
       res.status(500).json(err.message);
     }
   },
-  getAllPersons: async (req, res) => {
-    try {
-      const allPerson = await Person.find();
-      res.status(200).json(allPerson);
-    } catch (err) {
-      res.status(500).json(err.message);
-    }
-  },
+  getAllPersons: async (req, res) => {},
 };
 

[Timeout] BlockStatement
src/controllers/user.controller.js:47:9
     }
   },
   getAllPersons: async (req, res) => {
-    try {
-      const allPerson = await Person.find();
-      res.status(200).json(allPerson);
-    } catch (err) {
+    try {} catch (err) {
       res.status(500).json(err.message);
     }

[NoCoverage] BlockStatement
src/controllers/user.controller.js:50:19
     try {
       const allPerson = await Person.find();
       res.status(200).json(allPerson);
-    } catch (err) {
-      res.status(500).json(err.message);
-    }
+    } catch (err) {}
   },
 };
