[NoCoverage] ArrowFunction
src/main.js:6:9
 
 mongoose
   .connect('mongodb+srv://commercedb:commercedb@cluster0.llnc9p0.mongodb.net/')
-  .then(() => console.log('Database is connected'))
+  .then(() => undefined)
   .catch((err) => {
     console.log(err);

[NoCoverage] BlockStatement
src/main.js:7:19
 mongoose
   .connect('mongodb+srv://commercedb:commercedb@cluster0.llnc9p0.mongodb.net/')
   .then(() => console.log('Database is connected'))
-  .catch((err) => {
-    console.log(err);
-  });
+  .catch((err) => {});
 
 const app = createApp();

[NoCoverage] ConditionalExpression
src/main.js:13:12
 
 const app = createApp();
 
-app.listen(process.env.PORT || 3000, () =>
+app.listen(true, () =>
   console.log(`Example app listening on port ${process.env.PORT || 3000}!`),
 );

[NoCoverage] LogicalOperator
src/main.js:13:12
 
 const app = createApp();
 
-app.listen(process.env.PORT || 3000, () =>
+app.listen(process.env.PORT && 3000, () =>
   console.log(`Example app listening on port ${process.env.PORT || 3000}!`),
 );

[NoCoverage] ConditionalExpression
src/main.js:14:48
 const app = createApp();
 
 app.listen(process.env.PORT || 3000, () =>
-  console.log(`Example app listening on port ${process.env.PORT || 3000}!`),
+  console.log(`Example app listening on port ${false}!`),
 );
 

[NoCoverage] LogicalOperator
src/main.js:14:48
 const app = createApp();
 
 app.listen(process.env.PORT || 3000, () =>
-  console.log(`Example app listening on port ${process.env.PORT || 3000}!`),
+  console.log(`Example app listening on port ${process.env.PORT && 3000}!`),
 );
 
