[NoCoverage] ObjectLiteral
src/models/Chatbox.js:4:43
 const mongoose = require('mongoose');
 
 // Define a MongoDB schema for the ChatBox collection
-const ChatBoxSchema = new mongoose.Schema({
-  idCustomer: {
-    type: mongoose.Schema.Types.ObjectId,
-    ref: 'Person',
-    required: true,
-  },
-  idAssistant: {
-    type: mongoose.Schema.Types.ObjectId,
-    ref: 'Person',
-    required: true,
-  },
-  content: String,
-  isSend: Number,
-  // You can add more fields as needed
-});
+const ChatBoxSchema = new mongoose.Schema({});
 
 // Define the ChatBox model based on the schema

[NoCoverage] BooleanLiteral
src/models/Chatbox.js:8:15
   idCustomer: {
     type: mongoose.Schema.Types.ObjectId,
     ref: 'Person',
-    required: true,
+    required: false,
   },
   idAssistant: {
