[NoCoverage] BooleanLiteral
src/models/Delivery.js:4:34
 const mongoose = require('mongoose');
 // Define a MongoDB schema for the Delivery collection
 const DeliverySchema = new mongoose.Schema({
-  type: { type: String, require: true },
+  type: { type: String, require: false },
   time: { type: Date, require: true },
   const: { type: Number, require: true },

[NoCoverage] BooleanLiteral
src/models/Delivery.js:5:32
 // Define a MongoDB schema for the Delivery collection
 const DeliverySchema = new mongoose.Schema({
   type: { type: String, require: true },
-  time: { type: Date, require: true },
+  time: { type: Date, require: false },
   const: { type: Number, require: true },
 });

[NoCoverage] BooleanLiteral
src/models/Delivery.js:6:35
 const DeliverySchema = new mongoose.Schema({
   type: { type: String, require: true },
   time: { type: Date, require: true },
-  const: { type: Number, require: true },
+  const: { type: Number, require: false },
 });
 

[NoCoverage] ObjectLiteral
src/models/Delivery.js:6:10
 const DeliverySchema = new mongoose.Schema({
   type: { type: String, require: true },
   time: { type: Date, require: true },
-  const: { type: Number, require: true },
+  const: {},
 });
 
