[NoCoverage] BlockStatement
src/models/Discount.js:14:44
     enum: ['Expired', 'Unexpired'],
   },
 });
-DiscountSchema.pre('save', function (next) {
-  if (this.exp_time >= new Date()) {
-    this.isExpire = 'Unexpired';
-  } else {
-    this.isExpire = 'Expired';
-  }
-  next();
-});
+DiscountSchema.pre('save', function (next) {});
 
 const Discount = mongoose.model('Discount', DiscountSchema);

[NoCoverage] BlockStatement
src/models/Discount.js:15:36
   },
 });
 DiscountSchema.pre('save', function (next) {
-  if (this.exp_time >= new Date()) {
-    this.isExpire = 'Unexpired';
-  } else {
+  if (this.exp_time >= new Date()) {} else {
     this.isExpire = 'Expired';
   }

[NoCoverage] EqualityOperator
src/models/Discount.js:15:7
   },
 });
 DiscountSchema.pre('save', function (next) {
-  if (this.exp_time >= new Date()) {
+  if (this.exp_time < new Date()) {
     this.isExpire = 'Unexpired';
   } else {

[NoCoverage] BlockStatement
src/models/Discount.js:17:10
 DiscountSchema.pre('save', function (next) {
   if (this.exp_time >= new Date()) {
     this.isExpire = 'Unexpired';
-  } else {
-    this.isExpire = 'Expired';
-  }
+  } else {}
   next();
 });
