[NoCoverage] ObjectLiteral
src/models/ListOfProductBuy.js:4:3
 const mongoose = require('mongoose');
 // Define a MongoDB schema for the ListOfProductBuy collection
 const ListOfProductBuySchema = new mongoose.Schema(
-  {
-    idCustomer: {
-      type: mongoose.Schema.Types.ObjectId,
-      ref: 'Person',
-      required: true,
-    },
-    idProduct: {
-      type: mongoose.Schema.Types.ObjectId,
-      ref: 'Product',
-      required: true,
-    },
-    idReceipt: {
-      type: mongoose.Schema.Types.ObjectId,
-      ref: 'Receipt',
-      required: true,
-    },
-  },
+  {},
   { timestamps: true },
 );

[NoCoverage] ObjectLiteral
src/models/ListOfProductBuy.js:5:17
 // Define a MongoDB schema for the ListOfProductBuy collection
 const ListOfProductBuySchema = new mongoose.Schema(
   {
-    idCustomer: {
-      type: mongoose.Schema.Types.ObjectId,
-      ref: 'Person',
-      required: true,
-    },
+    idCustomer: {},
     idProduct: {
       type: mongoose.Schema.Types.ObjectId,

[NoCoverage] BooleanLiteral
src/models/ListOfProductBuy.js:13:17
     idProduct: {
       type: mongoose.Schema.Types.ObjectId,
       ref: 'Product',
-      required: true,
+      required: false,
     },
     idReceipt: {

[NoCoverage] BooleanLiteral
src/models/ListOfProductBuy.js:18:17
     idReceipt: {
       type: mongoose.Schema.Types.ObjectId,
       ref: 'Receipt',
-      required: true,
+      required: false,
     },
   },

[NoCoverage] BooleanLiteral
src/models/ListOfProductBuy.js:21:17
       required: true,
     },
   },
-  { timestamps: true },
+  { timestamps: false },
 );
 

[NoCoverage] StringLiteral
src/models/ListOfProductBuy.js:25:3
 );
 
 const ListOfProductBuy = mongoose.model(
-  'ListOfProductBuy',
+  "",
   ListOfProductBuySchema,
 );
