[NoCoverage] ObjectLiteral
src/models/Order.js:4:3
 const mongoose = require('mongoose');
 // Define a MongoDB schema for the Order collection
 const OrderSchema = new mongoose.Schema(
-  {
-    idCustomer: {
-      type: mongoose.Schema.Types.ObjectId,
-      ref: 'Person',
-      required: true,
-    },
-    idProduct: {
-      type: mongoose.Schema.Types.ObjectId,
-      ref: 'Product',
-      required: true,
-    },
-    quantity: { type: Number, required: true },
-    idReceipt: {
-      type: mongoose.Schema.Types.ObjectId,
-      ref: 'Receipt',
-      required: true,
-    },
-    date: { type: Date, required: true },
-    status: { type: Number, required: true },
-  },
+  {},
   { timestamps: true },
 );

[NoCoverage] ObjectLiteral
src/models/Order.js:10:16
       ref: 'Person',
       required: true,
     },
-    idProduct: {
-      type: mongoose.Schema.Types.ObjectId,
-      ref: 'Product',
-      required: true,
-    },
+    idProduct: {},
     quantity: { type: Number, required: true },
     idReceipt: {

[NoCoverage] BooleanLiteral
src/models/Order.js:15:41
       ref: 'Product',
       required: true,
     },
-    quantity: { type: Number, required: true },
+    quantity: { type: Number, required: false },
     idReceipt: {
       type: mongoose.Schema.Types.ObjectId,

[NoCoverage] ObjectLiteral
src/models/Order.js:15:15
       ref: 'Product',
       required: true,
     },
-    quantity: { type: Number, required: true },
+    quantity: {},
     idReceipt: {
       type: mongoose.Schema.Types.ObjectId,

[NoCoverage] ObjectLiteral
src/models/Order.js:16:16
       required: true,
     },
     quantity: { type: Number, required: true },
-    idReceipt: {
-      type: mongoose.Schema.Types.ObjectId,
-      ref: 'Receipt',
-      required: true,
-    },
+    idReceipt: {},
     date: { type: Date, required: true },
     status: { type: Number, required: true },

[NoCoverage] BooleanLiteral
src/models/Order.js:21:35
       ref: 'Receipt',
       required: true,
     },
-    date: { type: Date, required: true },
+    date: { type: Date, required: false },
     status: { type: Number, required: true },
   },

[NoCoverage] ObjectLiteral
src/models/Order.js:21:11
       ref: 'Receipt',
       required: true,
     },
-    date: { type: Date, required: true },
+    date: {},
     status: { type: Number, required: true },
   },

[NoCoverage] BooleanLiteral
src/models/Order.js:22:39
       required: true,
     },
     date: { type: Date, required: true },
-    status: { type: Number, required: true },
+    status: { type: Number, required: false },
   },
   { timestamps: true },

[NoCoverage] ObjectLiteral
src/models/Order.js:24:3
     date: { type: Date, required: true },
     status: { type: Number, required: true },
   },
-  { timestamps: true },
+  {},
 );
 

[NoCoverage] StringLiteral
src/models/Order.js:27:30
   { timestamps: true },
 );
 
-const Order = mongoose.model('Order', OrderSchema);
+const Order = mongoose.model("", OrderSchema);
 
 module.exports = Order;
