[NoCoverage] ObjectLiteral
src/models/PaymentInfomation.js:3:53
 const mongoose = require('mongoose');
 // Define a MongoDB schema for the PaymentInfomation collection
-const paymentInfomationSchema = new mongoose.Schema({
-  idCustomer: {
-    type: mongoose.Schema.Types.ObjectId,
-    ref: 'Person',
-    required: true,
-  },
-
-  cardNumber: { type: String, required: true },
-  expDate: { type: Date, required: true },
-  ownName: { type: String, required: true },
-  csv: String,
-});
+const paymentInfomationSchema = new mongoose.Schema({});
 
 const PaymentInfomation = mongoose.model(

[NoCoverage] BooleanLiteral
src/models/PaymentInfomation.js:10:41
     required: true,
   },
 
-  cardNumber: { type: String, required: true },
+  cardNumber: { type: String, required: false },
   expDate: { type: Date, required: true },
   ownName: { type: String, required: true },

[NoCoverage] BooleanLiteral
src/models/PaymentInfomation.js:11:36
   },
 
   cardNumber: { type: String, required: true },
-  expDate: { type: Date, required: true },
+  expDate: { type: Date, required: false },
   ownName: { type: String, required: true },
   csv: String,

[NoCoverage] ObjectLiteral
src/models/PaymentInfomation.js:11:12
   },
 
   cardNumber: { type: String, required: true },
-  expDate: { type: Date, required: true },
+  expDate: {},
   ownName: { type: String, required: true },
   csv: String,

[NoCoverage] BooleanLiteral
src/models/PaymentInfomation.js:12:38
 
   cardNumber: { type: String, required: true },
   expDate: { type: Date, required: true },
-  ownName: { type: String, required: true },
+  ownName: { type: String, required: false },
   csv: String,
 });
