[NoCoverage] ObjectLiteral
src/models/ProductTechnical.js:3:52
 const mongoose = require('mongoose');
 // Define a MongoDB schema for the ProductTechnical collection
-const ProductTechnicalSchema = new mongoose.Schema({
-  idProduct: {
-    type: mongoose.Schema.Types.ObjectId,
-    ref: 'Product',
-    required: true,
-  },
-  nameOfAttribute: { type: String, require: true },
-  content: { type: String, require: true },
-  uses: { type: String, require: true },
-  material: { type: String, require: true },
-  exps: Number,
-});
+const ProductTechnicalSchema = new mongoose.Schema({});
 
 const ProductTechnical = mongoose.model(

[NoCoverage] ObjectLiteral
src/models/ProductTechnical.js:4:14
 const mongoose = require('mongoose');
 // Define a MongoDB schema for the ProductTechnical collection
 const ProductTechnicalSchema = new mongoose.Schema({
-  idProduct: {
-    type: mongoose.Schema.Types.ObjectId,
-    ref: 'Product',
-    required: true,
-  },
+  idProduct: {},
   nameOfAttribute: { type: String, require: true },
   content: { type: String, require: true },

[NoCoverage] BooleanLiteral
src/models/ProductTechnical.js:9:45
     ref: 'Product',
     required: true,
   },
-  nameOfAttribute: { type: String, require: true },
+  nameOfAttribute: { type: String, require: false },
   content: { type: String, require: true },
   uses: { type: String, require: true },

[NoCoverage] ObjectLiteral
src/models/ProductTechnical.js:9:20
     ref: 'Product',
     required: true,
   },
-  nameOfAttribute: { type: String, require: true },
+  nameOfAttribute: {},
   content: { type: String, require: true },
   uses: { type: String, require: true },

[NoCoverage] BooleanLiteral
src/models/ProductTechnical.js:10:37
     required: true,
   },
   nameOfAttribute: { type: String, require: true },
-  content: { type: String, require: true },
+  content: { type: String, require: false },
   uses: { type: String, require: true },
   material: { type: String, require: true },

[NoCoverage] ObjectLiteral
src/models/ProductTechnical.js:10:12
     required: true,
   },
   nameOfAttribute: { type: String, require: true },
-  content: { type: String, require: true },
+  content: {},
   uses: { type: String, require: true },
   material: { type: String, require: true },

[NoCoverage] BooleanLiteral
src/models/ProductTechnical.js:11:34
   },
   nameOfAttribute: { type: String, require: true },
   content: { type: String, require: true },
-  uses: { type: String, require: true },
+  uses: { type: String, require: false },
   material: { type: String, require: true },
   exps: Number,

[NoCoverage] BooleanLiteral
src/models/ProductTechnical.js:12:38
   nameOfAttribute: { type: String, require: true },
   content: { type: String, require: true },
   uses: { type: String, require: true },
-  material: { type: String, require: true },
+  material: { type: String, require: false },
   exps: Number,
 });
