[NoCoverage] ObjectLiteral
src/models/Receipt.js:4:15
 const mongoose = require('mongoose');
 // Define a MongoDB schema for the Receipt collection
 const ReceiptSchema = new mongoose.Schema({
-  idCustomer: {
-    type: mongoose.Schema.Types.ObjectId,
-    ref: 'Customer',
-    required: true,
-  },
+  idCustomer: {},
   paymentInfo: {
     type: mongoose.Schema.Types.ObjectId,

[NoCoverage] BooleanLiteral
src/models/Receipt.js:7:15
   idCustomer: {
     type: mongoose.Schema.Types.ObjectId,
     ref: 'Customer',
-    required: true,
+    required: false,
   },
   paymentInfo: {

[NoCoverage] ObjectLiteral
src/models/Receipt.js:9:16
     ref: 'Customer',
     required: true,
   },
-  paymentInfo: {
-    type: mongoose.Schema.Types.ObjectId,
-    ref: 'PaymentInfomation',
-    required: true,
-  },
+  paymentInfo: {},
   receiverInfo: {
     type: mongoose.Schema.Types.ObjectId,

[NoCoverage] BooleanLiteral
src/models/Receipt.js:12:15
   paymentInfo: {
     type: mongoose.Schema.Types.ObjectId,
     ref: 'PaymentInfomation',
-    required: true,
+    required: false,
   },
   receiverInfo: {

[NoCoverage] BooleanLiteral
src/models/Receipt.js:17:15
   receiverInfo: {
     type: mongoose.Schema.Types.ObjectId,
     ref: 'ReceiverInfomation',
-    required: true,
+    required: false,
   },
   typeOfDelivery: {

[NoCoverage] BooleanLiteral
src/models/Receipt.js:22:15
   typeOfDelivery: {
     type: mongoose.Schema.Types.ObjectId,
     ref: 'Delivery',
-    required: true,
+    required: false,
   },
   totalCost: { type: Number, required: true },

[NoCoverage] BooleanLiteral
src/models/Receipt.js:24:40
     ref: 'Delivery',
     required: true,
   },
-  totalCost: { type: Number, required: true },
+  totalCost: { type: Number, required: false },
   date: { type: Date, required: true },
   status: { type: Number },

[NoCoverage] BooleanLiteral
src/models/Receipt.js:25:33
     required: true,
   },
   totalCost: { type: Number, required: true },
-  date: { type: Date, required: true },
+  date: { type: Date, required: false },
   status: { type: Number },
   saleValue: Number,

[NoCoverage] ObjectLiteral
src/models/Receipt.js:26:11
   },
   totalCost: { type: Number, required: true },
   date: { type: Date, required: true },
-  status: { type: Number },
+  status: {},
   saleValue: Number,
   idDiscount: {

[NoCoverage] ObjectLiteral
src/models/Receipt.js:28:15
   date: { type: Date, required: true },
   status: { type: Number },
   saleValue: Number,
-  idDiscount: {
-    type: mongoose.Schema.Types.ObjectId,
-    ref: 'Discount',
-    required: true,
-  },
+  idDiscount: {},
 });
 

[NoCoverage] BooleanLiteral
src/models/Receipt.js:31:15
   idDiscount: {
     type: mongoose.Schema.Types.ObjectId,
     ref: 'Discount',
-    required: true,
+    required: false,
   },
 });
