[NoCoverage] StringLiteral
src/models/ReceiverInfomation.js:6:10
 const ReceiverInfomationSchema = new mongoose.Schema({
   idCustomer: {
     type: mongoose.Schema.Types.ObjectId,
-    ref: 'Person',
+    ref: "",
     required: true,
   },

[NoCoverage] BooleanLiteral
src/models/ReceiverInfomation.js:9:34
     ref: 'Person',
     required: true,
   },
-  name: { type: String, require: true },
+  name: { type: String, require: false },
   address: { type: String, require: true },
   phoneNumber: { type: Number, required: true },

[NoCoverage] ObjectLiteral
src/models/ReceiverInfomation.js:9:9
     ref: 'Person',
     required: true,
   },
-  name: { type: String, require: true },
+  name: {},
   address: { type: String, require: true },
   phoneNumber: { type: Number, required: true },

[NoCoverage] BooleanLiteral
src/models/ReceiverInfomation.js:10:37
     required: true,
   },
   name: { type: String, require: true },
-  address: { type: String, require: true },
+  address: { type: String, require: false },
   phoneNumber: { type: Number, required: true },
   Note: { type: String, require: false },

[NoCoverage] BooleanLiteral
src/models/ReceiverInfomation.js:11:42
   },
   name: { type: String, require: true },
   address: { type: String, require: true },
-  phoneNumber: { type: Number, required: true },
+  phoneNumber: { type: Number, required: false },
   Note: { type: String, require: false },
 });

[NoCoverage] BooleanLiteral
src/models/ReceiverInfomation.js:12:34
   name: { type: String, require: true },
   address: { type: String, require: true },
   phoneNumber: { type: Number, required: true },
-  Note: { type: String, require: false },
+  Note: { type: String, require: true },
 });
 

[NoCoverage] ObjectLiteral
src/models/ReceiverInfomation.js:12:9
   name: { type: String, require: true },
   address: { type: String, require: true },
   phoneNumber: { type: Number, required: true },
-  Note: { type: String, require: false },
+  Note: {},
 });
 
