[Killed] BlockStatement
src/services/category.service.js:2:43
 const Category = require('../models/Category');
-exports.createNewCategory = (category) => {
-  return new Promise(async (resolve, reject) => {
-    try {
-      if (category.type != undefined) {
-        const newCategory = new Category(category);
-        const saveCategory = await newCategory.save();
-        const { __v, createdAt, updatedAt, ...newCategoryInfo } =
-          saveCategory._doc;
-        resolve(newCategoryInfo);
-      } else reject('Missing parameter');
-    } catch (e) {
-      reject(e);
-    }
-  });
-};
+exports.createNewCategory = (category) => {};
 exports.updateCategory = (categoryId, category) => {
   return new Promise(async (resolve, reject) => {
killedBy: category get category route given the category does exist should return a 200 status and the category
statusReason: TypeError: Cannot read properties of undefined (reading '_id')

[Timeout] BlockStatement
src/services/category.service.js:3:49
 const Category = require('../models/Category');
 exports.createNewCategory = (category) => {
-  return new Promise(async (resolve, reject) => {
-    try {
-      if (category.type != undefined) {
-        const newCategory = new Category(category);
-        const saveCategory = await newCategory.save();
-        const { __v, createdAt, updatedAt, ...newCategoryInfo } =
-          saveCategory._doc;
-        resolve(newCategoryInfo);
-      } else reject('Missing parameter');
-    } catch (e) {
-      reject(e);
-    }
-  });
+  return new Promise(async (resolve, reject) => {});
 };
 exports.updateCategory = (categoryId, category) => {

[Timeout] BlockStatement
src/services/category.service.js:4:9
 const Category = require('../models/Category');
 exports.createNewCategory = (category) => {
   return new Promise(async (resolve, reject) => {
-    try {
-      if (category.type != undefined) {
-        const newCategory = new Category(category);
-        const saveCategory = await newCategory.save();
-        const { __v, createdAt, updatedAt, ...newCategoryInfo } =
-          saveCategory._doc;
-        resolve(newCategoryInfo);
-      } else reject('Missing parameter');
-    } catch (e) {
+    try {} catch (e) {
       reject(e);
     }

[Killed] ConditionalExpression
src/services/category.service.js:5:11
 exports.createNewCategory = (category) => {
   return new Promise(async (resolve, reject) => {
     try {
-      if (category.type != undefined) {
+      if (false) {
         const newCategory = new Category(category);
         const saveCategory = await newCategory.save();
killedBy: category get category route given the category does exist should return a 200 status and the category
statusReason: Error: thrown: "Missing parameter"

[Killed] EqualityOperator
src/services/category.service.js:5:11
 exports.createNewCategory = (category) => {
   return new Promise(async (resolve, reject) => {
     try {
-      if (category.type != undefined) {
+      if (category.type == undefined) {
         const newCategory = new Category(category);
         const saveCategory = await newCategory.save();
killedBy: category get category route given the category does exist should return a 200 status and the category
statusReason: Error: thrown: "Missing parameter"

[NoCoverage] BlockStatement
src/services/category.service.js:12:17
           saveCategory._doc;
         resolve(newCategoryInfo);
       } else reject('Missing parameter');
-    } catch (e) {
-      reject(e);
-    }
+    } catch (e) {}
   });
 };

[Killed] BlockStatement
src/services/category.service.js:17:52
     }
   });
 };
-exports.updateCategory = (categoryId, category) => {
-  return new Promise(async (resolve, reject) => {
-    try {
-      await Category.findByIdAndUpdate(categoryId, category);
-      const updateCategory = await Category.findById(categoryId);
-      resolve(updateCategory);
-    } catch (e) {
-      reject(e);
-    }
-  });
-};
+exports.updateCategory = (categoryId, category) => {};
 exports.getListCategory = () => {
   return new Promise(async (resolve, reject) => {
killedBy: category update category route given the user is logged in should return a 200 and update the category
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"__v": Any<Number>, "_id": Any<String>, "type": "UpdateLaptop"}
Received: ""

[Timeout] BlockStatement
src/services/category.service.js:18:49
   });
 };
 exports.updateCategory = (categoryId, category) => {
-  return new Promise(async (resolve, reject) => {
-    try {
-      await Category.findByIdAndUpdate(categoryId, category);
-      const updateCategory = await Category.findById(categoryId);
-      resolve(updateCategory);
-    } catch (e) {
-      reject(e);
-    }
-  });
+  return new Promise(async (resolve, reject) => {});
 };
 exports.getListCategory = () => {

[Timeout] BlockStatement
src/services/category.service.js:19:9
 };
 exports.updateCategory = (categoryId, category) => {
   return new Promise(async (resolve, reject) => {
-    try {
-      await Category.findByIdAndUpdate(categoryId, category);
-      const updateCategory = await Category.findById(categoryId);
-      resolve(updateCategory);
-    } catch (e) {
+    try {} catch (e) {
       reject(e);
     }

[NoCoverage] BlockStatement
src/services/category.service.js:23:17
       await Category.findByIdAndUpdate(categoryId, category);
       const updateCategory = await Category.findById(categoryId);
       resolve(updateCategory);
-    } catch (e) {
-      reject(e);
-    }
+    } catch (e) {}
   });
 };

[Killed] BlockStatement
src/services/category.service.js:28:33
     }
   });
 };
-exports.getListCategory = () => {
-  return new Promise(async (resolve, reject) => {
-    try {
-      const allCategory = await Category.find();
-      resolve(allCategory);
-    } catch (e) {
-      reject(e);
-    }
-  });
-};
+exports.getListCategory = () => {};
 
killedBy: category get all categories route should return a 200 and an array of categories 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: Any<Array>
Received: ""

[Timeout] BlockStatement
src/services/category.service.js:29:49
   });
 };
 exports.getListCategory = () => {
-  return new Promise(async (resolve, reject) => {
-    try {
-      const allCategory = await Category.find();
-      resolve(allCategory);
-    } catch (e) {
-      reject(e);
-    }
-  });
+  return new Promise(async (resolve, reject) => {});
 };
 

[Timeout] BlockStatement
src/services/category.service.js:30:9
 };
 exports.getListCategory = () => {
   return new Promise(async (resolve, reject) => {
-    try {
-      const allCategory = await Category.find();
-      resolve(allCategory);
-    } catch (e) {
+    try {} catch (e) {
       reject(e);
     }

[NoCoverage] BlockStatement
src/services/category.service.js:33:17
     try {
       const allCategory = await Category.find();
       resolve(allCategory);
-    } catch (e) {
-      reject(e);
-    }
+    } catch (e) {}
   });
 };
