[Killed] BlockStatement
src/services/discount.service.js:4:26
 const Discount = require('../models/Discount');
 
 module.exports = {
-  getAllDiscounts: () => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const discounts = await Discount.find()
-          .limit(10)
-          .sort({ startAt: 1 })
-          .exec();
-        resolve(discounts);
-      } catch (error) {
-        reject(error);
-      }
-    });
-  },
+  getAllDiscounts: () => {},
   getDiscountById: (discountId) => {
     return new Promise(async (resolve, reject) => {
killedBy: discount Get All Discounts Discounts are found Should return 200 status code and the discounts
statusReason: Error: expected 200 "OK", got 404 "Not Found"

[Timeout] BlockStatement
src/services/discount.service.js:5:51
 
 module.exports = {
   getAllDiscounts: () => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const discounts = await Discount.find()
-          .limit(10)
-          .sort({ startAt: 1 })
-          .exec();
-        resolve(discounts);
-      } catch (error) {
-        reject(error);
-      }
-    });
+    return new Promise(async (resolve, reject) => {});
   },
   getDiscountById: (discountId) => {

[Timeout] BlockStatement
src/services/discount.service.js:6:11
 module.exports = {
   getAllDiscounts: () => {
     return new Promise(async (resolve, reject) => {
-      try {
-        const discounts = await Discount.find()
-          .limit(10)
-          .sort({ startAt: 1 })
-          .exec();
-        resolve(discounts);
-      } catch (error) {
+      try {} catch (error) {
         reject(error);
       }

[Survived] MethodExpression
src/services/discount.service.js:7:33
   getAllDiscounts: () => {
     return new Promise(async (resolve, reject) => {
       try {
-        const discounts = await Discount.find()
-          .limit(10)
-          .sort({ startAt: 1 })
+        const discounts = await Discount.find().limit(10)
           .exec();
         resolve(discounts);

[Survived] ObjectLiteral
src/services/discount.service.js:9:17
       try {
         const discounts = await Discount.find()
           .limit(10)
-          .sort({ startAt: 1 })
+          .sort({})
           .exec();
         resolve(discounts);

[NoCoverage] BlockStatement
src/services/discount.service.js:12:23
           .sort({ startAt: 1 })
           .exec();
         resolve(discounts);
-      } catch (error) {
-        reject(error);
-      }
+      } catch (error) {}
     });
   },

[NoCoverage] BlockStatement
src/services/discount.service.js:17:36
       }
     });
   },
-  getDiscountById: (discountId) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const discount = await Discount.findById(discountId);
-        resolve(discount);
-      } catch (error) {
-        reject(error);
-      }
-    });
-  },
+  getDiscountById: (discountId) => {},
   createNewDiscount: (discountInfo) => {
     return new Promise(async (resolve, reject) => {

[NoCoverage] BlockStatement
src/services/discount.service.js:18:51
     });
   },
   getDiscountById: (discountId) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const discount = await Discount.findById(discountId);
-        resolve(discount);
-      } catch (error) {
-        reject(error);
-      }
-    });
+    return new Promise(async (resolve, reject) => {});
   },
   createNewDiscount: (discountInfo) => {

[NoCoverage] BlockStatement
src/services/discount.service.js:19:11
   },
   getDiscountById: (discountId) => {
     return new Promise(async (resolve, reject) => {
-      try {
-        const discount = await Discount.findById(discountId);
-        resolve(discount);
-      } catch (error) {
+      try {} catch (error) {
         reject(error);
       }

[NoCoverage] BlockStatement
src/services/discount.service.js:22:23
       try {
         const discount = await Discount.findById(discountId);
         resolve(discount);
-      } catch (error) {
-        reject(error);
-      }
+      } catch (error) {}
     });
   },

[NoCoverage] BlockStatement
src/services/discount.service.js:27:40
       }
     });
   },
-  createNewDiscount: (discountInfo) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const newDiscount = new Discount(discountInfo);
-        const saveDiscount = await newDiscount.save();
-        const { __v, createdAt, updatedAt, ...newDiscountInfo } =
-          saveDiscount._doc;
-        resolve(newDiscountInfo);
-      } catch (error) {
-        reject(error);
-      }
-    });
-  },
+  createNewDiscount: (discountInfo) => {},
   updateDiscount: (discountId, newDiscountInfo) => {
     return new Promise(async (resolve, reject) => {

[NoCoverage] BlockStatement
src/services/discount.service.js:28:51
     });
   },
   createNewDiscount: (discountInfo) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const newDiscount = new Discount(discountInfo);
-        const saveDiscount = await newDiscount.save();
-        const { __v, createdAt, updatedAt, ...newDiscountInfo } =
-          saveDiscount._doc;
-        resolve(newDiscountInfo);
-      } catch (error) {
-        reject(error);
-      }
-    });
+    return new Promise(async (resolve, reject) => {});
   },
   updateDiscount: (discountId, newDiscountInfo) => {

[NoCoverage] BlockStatement
src/services/discount.service.js:29:11
   },
   createNewDiscount: (discountInfo) => {
     return new Promise(async (resolve, reject) => {
-      try {
-        const newDiscount = new Discount(discountInfo);
-        const saveDiscount = await newDiscount.save();
-        const { __v, createdAt, updatedAt, ...newDiscountInfo } =
-          saveDiscount._doc;
-        resolve(newDiscountInfo);
-      } catch (error) {
+      try {} catch (error) {
         reject(error);
       }

[NoCoverage] BlockStatement
src/services/discount.service.js:35:23
         const { __v, createdAt, updatedAt, ...newDiscountInfo } =
           saveDiscount._doc;
         resolve(newDiscountInfo);
-      } catch (error) {
-        reject(error);
-      }
+      } catch (error) {}
     });
   },

[NoCoverage] BlockStatement
src/services/discount.service.js:40:52
       }
     });
   },
-  updateDiscount: (discountId, newDiscountInfo) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const updatedDiscount = await Discount.findByIdAndUpdate(
-          discountId,
-          {
-            $set: newDiscountInfo,
-          },
-          {
-            new: true,
-          },
-        );
-        const { __v, createdAt, updatedAt, ...others } = updatedDiscount._doc;
-        resolve(others);
-      } catch (error) {
-        reject(error);
-      }
-    });
-  },
+  updateDiscount: (discountId, newDiscountInfo) => {},
   deleteDiscount: (discountId) => {
     return new Promise(async (resolve, reject) => {

[NoCoverage] BlockStatement
src/services/discount.service.js:41:51
     });
   },
   updateDiscount: (discountId, newDiscountInfo) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const updatedDiscount = await Discount.findByIdAndUpdate(
-          discountId,
-          {
-            $set: newDiscountInfo,
-          },
-          {
-            new: true,
-          },
-        );
-        const { __v, createdAt, updatedAt, ...others } = updatedDiscount._doc;
-        resolve(others);
-      } catch (error) {
-        reject(error);
-      }
-    });
+    return new Promise(async (resolve, reject) => {});
   },
   deleteDiscount: (discountId) => {

[NoCoverage] BlockStatement
src/services/discount.service.js:42:11
   },
   updateDiscount: (discountId, newDiscountInfo) => {
     return new Promise(async (resolve, reject) => {
-      try {
-        const updatedDiscount = await Discount.findByIdAndUpdate(
-          discountId,
-          {
-            $set: newDiscountInfo,
-          },
-          {
-            new: true,
-          },
-        );
-        const { __v, createdAt, updatedAt, ...others } = updatedDiscount._doc;
-        resolve(others);
-      } catch (error) {
+      try {} catch (error) {
         reject(error);
       }

[NoCoverage] BlockStatement
src/services/discount.service.js:54:23
         );
         const { __v, createdAt, updatedAt, ...others } = updatedDiscount._doc;
         resolve(others);
-      } catch (error) {
-        reject(error);
-      }
+      } catch (error) {}
     });
   },

[NoCoverage] BlockStatement
src/services/discount.service.js:59:35
       }
     });
   },
-  deleteDiscount: (discountId) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const deletedDiscount = await Discount.findByIdAndDelete(discountId);
-        resolve(deletedDiscount);
-      } catch (error) {
-        reject(error);
-      }
-    });
-  },
+  deleteDiscount: (discountId) => {},
 };
 

[NoCoverage] BlockStatement
src/services/discount.service.js:60:51
     });
   },
   deleteDiscount: (discountId) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const deletedDiscount = await Discount.findByIdAndDelete(discountId);
-        resolve(deletedDiscount);
-      } catch (error) {
-        reject(error);
-      }
-    });
+    return new Promise(async (resolve, reject) => {});
   },
 };

[NoCoverage] BlockStatement
src/services/discount.service.js:61:11
   },
   deleteDiscount: (discountId) => {
     return new Promise(async (resolve, reject) => {
-      try {
-        const deletedDiscount = await Discount.findByIdAndDelete(discountId);
-        resolve(deletedDiscount);
-      } catch (error) {
+      try {} catch (error) {
         reject(error);
       }

[NoCoverage] BlockStatement
src/services/discount.service.js:64:23
       try {
         const deletedDiscount = await Discount.findByIdAndDelete(discountId);
         resolve(deletedDiscount);
-      } catch (error) {
-        reject(error);
-      }
+      } catch (error) {}
     });
   },
