[NoCoverage] BlockStatement
src/services/listOfProductBuy.service.js:4:54
 const ListOfProductBuy = require('../models/ListOfProductBuy');
 
 module.exports = {
-  createNewListProductBuy: (ListOfProductBuyInfo) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const newListProductBuy = new ListOfProductBuy(ListOfProductBuyInfo);
-        const saveListProductBuy = await newListProductBuy.save();
-        const { __v, createdAt, updatedAt, ...newListProductInfo } =
-          saveListProductBuy._doc;
-        resolve(newListProductInfo);
-      } catch (error) {
-        reject(error);
-      }
-    });
-  },
+  createNewListProductBuy: (ListOfProductBuyInfo) => {},
   updateListProductBuy: (listOfProductId, ListOfProductBuyInfo) => {
     return new Promise(async (resolve, reject) => {

[NoCoverage] BlockStatement
src/services/listOfProductBuy.service.js:5:51
 
 module.exports = {
   createNewListProductBuy: (ListOfProductBuyInfo) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const newListProductBuy = new ListOfProductBuy(ListOfProductBuyInfo);
-        const saveListProductBuy = await newListProductBuy.save();
-        const { __v, createdAt, updatedAt, ...newListProductInfo } =
-          saveListProductBuy._doc;
-        resolve(newListProductInfo);
-      } catch (error) {
-        reject(error);
-      }
-    });
+    return new Promise(async (resolve, reject) => {});
   },
   updateListProductBuy: (listOfProductId, ListOfProductBuyInfo) => {

[NoCoverage] BlockStatement
src/services/listOfProductBuy.service.js:6:11
 module.exports = {
   createNewListProductBuy: (ListOfProductBuyInfo) => {
     return new Promise(async (resolve, reject) => {
-      try {
-        const newListProductBuy = new ListOfProductBuy(ListOfProductBuyInfo);
-        const saveListProductBuy = await newListProductBuy.save();
-        const { __v, createdAt, updatedAt, ...newListProductInfo } =
-          saveListProductBuy._doc;
-        resolve(newListProductInfo);
-      } catch (error) {
+      try {} catch (error) {
         reject(error);
       }

[NoCoverage] BlockStatement
src/services/listOfProductBuy.service.js:12:23
         const { __v, createdAt, updatedAt, ...newListProductInfo } =
           saveListProductBuy._doc;
         resolve(newListProductInfo);
-      } catch (error) {
-        reject(error);
-      }
+      } catch (error) {}
     });
   },

[NoCoverage] BlockStatement
src/services/listOfProductBuy.service.js:17:68
       }
     });
   },
-  updateListProductBuy: (listOfProductId, ListOfProductBuyInfo) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const updatedListProductBuy = await ListOfProductBuy.findOneAndUpdate(
-          listOfProductId,
-          {
-            $set: ListOfProductBuyInfo,
-          },
-          {
-            new: true,
-          },
-        );
-        const { __v, createdAt, updatedAt, ...others } =
-          updatedListProductBuy._doc;
-        resolve(others);
-      } catch (error) {
-        reject(error);
-      }
-    });
-  },
+  updateListProductBuy: (listOfProductId, ListOfProductBuyInfo) => {},
   deleteListProductBuy: (listOfProductId) => {
     return new Promise(async (resolve, reject) => {

[NoCoverage] BlockStatement
src/services/listOfProductBuy.service.js:18:51
     });
   },
   updateListProductBuy: (listOfProductId, ListOfProductBuyInfo) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const updatedListProductBuy = await ListOfProductBuy.findOneAndUpdate(
-          listOfProductId,
-          {
-            $set: ListOfProductBuyInfo,
-          },
-          {
-            new: true,
-          },
-        );
-        const { __v, createdAt, updatedAt, ...others } =
-          updatedListProductBuy._doc;
-        resolve(others);
-      } catch (error) {
-        reject(error);
-      }
-    });
+    return new Promise(async (resolve, reject) => {});
   },
   deleteListProductBuy: (listOfProductId) => {

[NoCoverage] BlockStatement
src/services/listOfProductBuy.service.js:19:11
   },
   updateListProductBuy: (listOfProductId, ListOfProductBuyInfo) => {
     return new Promise(async (resolve, reject) => {
-      try {
-        const updatedListProductBuy = await ListOfProductBuy.findOneAndUpdate(
-          listOfProductId,
-          {
-            $set: ListOfProductBuyInfo,
-          },
-          {
-            new: true,
-          },
-        );
-        const { __v, createdAt, updatedAt, ...others } =
-          updatedListProductBuy._doc;
-        resolve(others);
-      } catch (error) {
+      try {} catch (error) {
         reject(error);
       }

[NoCoverage] ObjectLiteral
src/services/listOfProductBuy.service.js:25:11
           {
             $set: ListOfProductBuyInfo,
           },
-          {
-            new: true,
-          },
+          {},
         );
         const { __v, createdAt, updatedAt, ...others } =

[NoCoverage] BlockStatement
src/services/listOfProductBuy.service.js:37:46
       }
     });
   },
-  deleteListProductBuy: (listOfProductId) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const deletedListProductBuy = await ListOfProductBuy.findByIdAndDelete(
-          discountId,
-        );
-        resolve(deletedListProductBuy);
-      } catch (error) {
-        reject(error);
-      }
-    });
-  },
+  deleteListProductBuy: (listOfProductId) => {},
   getListOfProductOfCustomer: (idCustomer) => {
     return new Promise(async (resolve, reject) => {

[NoCoverage] BlockStatement
src/services/listOfProductBuy.service.js:38:51
     });
   },
   deleteListProductBuy: (listOfProductId) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const deletedListProductBuy = await ListOfProductBuy.findByIdAndDelete(
-          discountId,
-        );
-        resolve(deletedListProductBuy);
-      } catch (error) {
-        reject(error);
-      }
-    });
+    return new Promise(async (resolve, reject) => {});
   },
   getListOfProductOfCustomer: (idCustomer) => {

[NoCoverage] BlockStatement
src/services/listOfProductBuy.service.js:39:11
   },
   deleteListProductBuy: (listOfProductId) => {
     return new Promise(async (resolve, reject) => {
-      try {
-        const deletedListProductBuy = await ListOfProductBuy.findByIdAndDelete(
-          discountId,
-        );
-        resolve(deletedListProductBuy);
-      } catch (error) {
+      try {} catch (error) {
         reject(error);
       }

[NoCoverage] BlockStatement
src/services/listOfProductBuy.service.js:44:23
           discountId,
         );
         resolve(deletedListProductBuy);
-      } catch (error) {
-        reject(error);
-      }
+      } catch (error) {}
     });
   },

[NoCoverage] BlockStatement
src/services/listOfProductBuy.service.js:49:47
       }
     });
   },
-  getListOfProductOfCustomer: (idCustomer) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const listOfProducts = await ListOfProductBuy.find({ idCustomer });
-        resolve(listOfProducts);
-      } catch (error) {
-        reject(error);
-      }
-    });
-  },
+  getListOfProductOfCustomer: (idCustomer) => {},
 };
 

[NoCoverage] BlockStatement
src/services/listOfProductBuy.service.js:50:51
     });
   },
   getListOfProductOfCustomer: (idCustomer) => {
-    return new Promise(async (resolve, reject) => {
-      try {
-        const listOfProducts = await ListOfProductBuy.find({ idCustomer });
-        resolve(listOfProducts);
-      } catch (error) {
-        reject(error);
-      }
-    });
+    return new Promise(async (resolve, reject) => {});
   },
 };

[NoCoverage] BlockStatement
src/services/listOfProductBuy.service.js:51:11
   },
   getListOfProductOfCustomer: (idCustomer) => {
     return new Promise(async (resolve, reject) => {
-      try {
-        const listOfProducts = await ListOfProductBuy.find({ idCustomer });
-        resolve(listOfProducts);
-      } catch (error) {
+      try {} catch (error) {
         reject(error);
       }

[NoCoverage] BlockStatement
src/services/listOfProductBuy.service.js:54:23
       try {
         const listOfProducts = await ListOfProductBuy.find({ idCustomer });
         resolve(listOfProducts);
-      } catch (error) {
-        reject(error);
-      }
+      } catch (error) {}
     });
   },
