[Killed] BlockStatement
src/services/product.service.js:2:41
 const Product = require('../models/Product');
-exports.createNewProduct = (product) => {
-  return new Promise(async (resolve, reject) => {
-    try {
-      const newProduct = new Product(product);
-      const saveProduct = await newProduct.save();
-      const { __v, createdAt, updatedAt, ...newProductInfo } = saveProduct._doc;
-      resolve(newProductInfo);
-    } catch (e) {
-      reject(e);
-    }
-  });
-};
+exports.createNewProduct = (product) => {};
 exports.updateProduct = (productId, product) => {
   return new Promise(async (resolve, reject) => {
killedBy: product get product route given the product does exist should return a 200 status and the product
statusReason: TypeError: Cannot read properties of undefined (reading '_id')

[Timeout] BlockStatement
src/services/product.service.js:3:49
 const Product = require('../models/Product');
 exports.createNewProduct = (product) => {
-  return new Promise(async (resolve, reject) => {
-    try {
-      const newProduct = new Product(product);
-      const saveProduct = await newProduct.save();
-      const { __v, createdAt, updatedAt, ...newProductInfo } = saveProduct._doc;
-      resolve(newProductInfo);
-    } catch (e) {
-      reject(e);
-    }
-  });
+  return new Promise(async (resolve, reject) => {});
 };
 exports.updateProduct = (productId, product) => {

[Timeout] BlockStatement
src/services/product.service.js:4:9
 const Product = require('../models/Product');
 exports.createNewProduct = (product) => {
   return new Promise(async (resolve, reject) => {
-    try {
-      const newProduct = new Product(product);
-      const saveProduct = await newProduct.save();
-      const { __v, createdAt, updatedAt, ...newProductInfo } = saveProduct._doc;
-      resolve(newProductInfo);
-    } catch (e) {
+    try {} catch (e) {
       reject(e);
     }

[NoCoverage] BlockStatement
src/services/product.service.js:9:17
       const saveProduct = await newProduct.save();
       const { __v, createdAt, updatedAt, ...newProductInfo } = saveProduct._doc;
       resolve(newProductInfo);
-    } catch (e) {
-      reject(e);
-    }
+    } catch (e) {}
   });
 };

[Killed] BlockStatement
src/services/product.service.js:14:49
     }
   });
 };
-exports.updateProduct = (productId, product) => {
-  return new Promise(async (resolve, reject) => {
-    try {
-      // console.log(productId);
-      // console.log(product);
-      await Product.findByIdAndUpdate(productId, product);
-      const updateProduct = await Product.findById(productId);
-      resolve(updateProduct);
-    } catch (e) {
-      reject(e);
-    }
-  });
-};
+exports.updateProduct = (productId, product) => {};
 exports.getListProduct = () => {
   return new Promise(async (resolve, reject) => {
killedBy: product update product route given the user is logged in should return a 200 and update the product
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: ""

[Timeout] BlockStatement
src/services/product.service.js:15:49
   });
 };
 exports.updateProduct = (productId, product) => {
-  return new Promise(async (resolve, reject) => {
-    try {
-      // console.log(productId);
-      // console.log(product);
-      await Product.findByIdAndUpdate(productId, product);
-      const updateProduct = await Product.findById(productId);
-      resolve(updateProduct);
-    } catch (e) {
-      reject(e);
-    }
-  });
+  return new Promise(async (resolve, reject) => {});
 };
 exports.getListProduct = () => {

[Timeout] BlockStatement
src/services/product.service.js:16:9
 };
 exports.updateProduct = (productId, product) => {
   return new Promise(async (resolve, reject) => {
-    try {
-      // console.log(productId);
-      // console.log(product);
-      await Product.findByIdAndUpdate(productId, product);
-      const updateProduct = await Product.findById(productId);
-      resolve(updateProduct);
-    } catch (e) {
+    try {} catch (e) {
       reject(e);
     }

[NoCoverage] BlockStatement
src/services/product.service.js:22:17
       await Product.findByIdAndUpdate(productId, product);
       const updateProduct = await Product.findById(productId);
       resolve(updateProduct);
-    } catch (e) {
-      reject(e);
-    }
+    } catch (e) {}
   });
 };

[Killed] BlockStatement
src/services/product.service.js:27:32
     }
   });
 };
-exports.getListProduct = () => {
-  return new Promise(async (resolve, reject) => {
-    try {
-      const allProduct = await Product.find().exec();
-      resolve(allProduct);
-    } catch (e) {
-      reject(e);
-    }
-  });
-};
+exports.getListProduct = () => {};
 
killedBy: product get all products route should return a 200 and an array of products 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: Any<Array>
Received: ""

[Timeout] BlockStatement
src/services/product.service.js:28:49
   });
 };
 exports.getListProduct = () => {
-  return new Promise(async (resolve, reject) => {
-    try {
-      const allProduct = await Product.find().exec();
-      resolve(allProduct);
-    } catch (e) {
-      reject(e);
-    }
-  });
+  return new Promise(async (resolve, reject) => {});
 };
 

[Timeout] BlockStatement
src/services/product.service.js:29:9
 };
 exports.getListProduct = () => {
   return new Promise(async (resolve, reject) => {
-    try {
-      const allProduct = await Product.find().exec();
-      resolve(allProduct);
-    } catch (e) {
+    try {} catch (e) {
       reject(e);
     }

[NoCoverage] BlockStatement
src/services/product.service.js:32:17
     try {
       const allProduct = await Product.find().exec();
       resolve(allProduct);
-    } catch (e) {
-      reject(e);
-    }
+    } catch (e) {}
   });
 };
