[Killed] BlockStatement
src/models/Product.js:27:44
     },
   ],
 });
-ProductSchema.methods.toJSON = function () {
-  var obj = this.toObject();
-  delete obj.__v;
-  return obj;
-};
+ProductSchema.methods.toJSON = function () {};
 
 const Product = mongoose.model('Product', ProductSchema);
killedBy: product update product route given the user is logged in should return a 200 and update the product
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: ""
